TritonDataCenter/smartos-live/man/man/man5/cheatsheet.5
.\" te
.\"  Copyright (c) 2011, Joyent, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing. See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CheatSheet 5 "26 May 2013" "SmartOS" "Linux to SmartOS Cheat Sheet"
.SH NAME
.B Linux to SmartOS Zone CheatSheet
.P
.SH SYNOPSIS
.B CheatSheet 
For Mapping \fBLinux\fR 
.I man
commands to \fBSmartOS\fR 
.I man 
commands


.SH AVAILABILITY
Applies Within A SmartOS Zone 
.B = SmartMachine Virtual Instance
.P
This CheatSheet does not apply to the SmartOS Global Zone.
.nf

Linux Specific Key
(rh)    Red Hat, CentOS
(deb)   Debian
(ub)    Ubuntu
(fed)   Fedora
(SUSE)  SUSE

.fi

Linux man section (1) are executable or shell commands, whereas section (8) specifies 
system administration commands that are run by root. SmartOS man pages are (1) or (1M).


.SH DESCRIPTION
SmartOS is an open source illumOS operating system distribtuion provided by Joyent.
It is optimized for enterprise grade cloud-based hypervisor services. illumOS based 
operating systems are forked from OpenSolaris. SmartOS is licensed under the 
Common Development and Distribution License (CDDL). 
.P
http://smartos.org
.P
The following is a list of commands to help Linux users find equivalent 
commands 
in SmartOS Zones and SmartMachines. 
.P
The things that make a SmartMachine different from other Unix-like systems 
generally fall in two categories:
.P
- Similar commands with different names in SmartOS.
.P
- Different procedures for accomplishing similar things in SmartOS.
.P
Many commands available on Linux are also available on SmartOS.
.P
For instance, you can use the pkgin package manager to install top(1).
.P
# pkgin install top


.SH EXAMPLES OF DIFFERENT USE CONTEXT IN SmartOS
Some common GNU/Linux commands have context differences in SmartOS/illumOS.
.PP
Some appear the same but have different use contexts and command-line parameters. 
Certain commands will be unsupported, but alternative commands are available
to provide similar functionality. Other commands may found and installed through 
the package management system pkgin, but the illumOS versions are reccommended.
.PP
.nf

Linux    |   SmartOS
Command  |   Difference
---------|------------------------------------------------------
df(1)    |   df(1M)
         |   Native illumOS version is /usr/bin/df    
         | # df -t /usr  (Prints free and totals)
---------|------------------------------------------------------
ping(8)  |   ping(1M)
         |   Returns whether a host responds or not.
         | # ping -s   (Returns a coninuous response)
----------------------------------------------------------------
lsof(8)  |   lsof -  list of open files - command not supported.
         |   proc(1) has commands like pfiles to show files
         |   open for a list of process IDs.
         | # pfiles $(pgrep bash)   (Files associated with bash)
---------|------------------------------------------------------
top(1)   |   prstat(1M) is zone aware and more accurate.
         |   top is available via pkgin
         | # pkgin -y install top   (Installs top)
-----------------------------------------------------------------        
.fi


.SH SmartOS PROCESS TOOLS PROC(1)
The SmartOS proc(1) man page 
describes the suite of tools used to examine processes.
.PP
.nf

SmartOS
Tool     |  Description
---------|---------------------------------------------------------------
prstat   |  Displays active processes - like top
         |# prstat -Z   (Prints summary of status)
         |# prstat -p $(pgrep -d ',' login)  (Displays 'login' processes)
         |# prstat -P 0  (Displays processes on cpu0)
---------|---------------------------------------------------------------
pgrep    |  Returns a list of process IDs (PIDs) that match 
         |  a pattern or meet certain conditions
         |# pgrep -G root  (Displays PIDs owned by root group)
---------|---------------------------------------------------------------
pkill    |  Kills processes that match a pattern or meet
         |  certain conditions
---------|---------------------------------------------------------------
pfiles   |  Returns a list of all the open files that belong 
         |  to a process
---------|---------------------------------------------------------------
pstack   |  Displays a stack trace of the specified process
         |
---------|---------------------------------------------------------------
ptree    |  Displays a process tree for all processes of a given 
         |  process
---------|---------------------------------------------------------------
ls /proc |  Lists the PIDs of all running processes
         |
---------|---------------------------------------------------------------

.fi
.B Note:
If prstat display changes your terminal settings,
use the
.B reset
command to return them to normal.


.SH INSTALLING SOFTWARE - SmartOS PACKAGE MANAGEMENT
.SH SHOW/SEARCH/INSTALL/UPDATE SOFTWARE PACKAGES
The pkgin system is used for managing software packages.
.P
Over 10,000 software packages are available.
.P
Packages are retrieved from the Joyent pkgsrc repository at:
.P
pkgsrc.joyent.com/packages/
.nf

Linux                  |   SmartOS
-----------------------|----------------
apt-get(8) (deb, ub)   |   pkgin(1)
yum(8)  (rh, fed)      |   
rpm(8)   (rh, fed)     |
dpkg(1) (deb, ub)      |
dselect (deb)          |

Show all pkgin commands:  pkgin
Update current packages:  pkgin update (Do this first)
Show installed software:  pkgin list
Available software:       pkgin avail
Search for software:      pkgin search ...
Install software:         pkgin install ... 
Install with prejudice:   pkgin in -y 

.fi


.SH MANAGING SmartOS SERVICES WITH THE SERVICE MANAGEMENT FACILITY
The Service Management Facility (SMF) is the SmartOS way to start and stop 
services (web, database, email, and so on) and provides two advantages:
.P
- It monitors services and restarts them automatically if they stop running.
.P
- It understands the dependencies between services. For example, SMF will not 
attempt to start your webserver if your network is down.
.P
The SMF facility in SmartOS is used to manage long running daemon processes like 
Apache and MySQL. Most of the relevant packages from the pkgin repository 
(pkgsrc) will come with a corresponding SMF manifest and do not require any 
interaction on your part other than enabling the service for the installed 
package (see svcadm). However, you may find a need for importing a manifest that 
manages a service you have custom compiled or created yourself.
.P
SMF consists of four command-line utilities:
.P
svcs(1): allows you to examine the state of your services and determine what 
went 
wrong.
.P
svcadm(1M): enable, disable, and restart a service.
.P
svccfg(1M): load manifest files (XML) that maintain configurations for each 
service.
.P
svcprop(1): retrieves properties on a service (useful when writing custom 
scripts)
.P
For more details visit: 
.P
http://wiki.smartos.org/display/DOC/Using+the+Service+Management+Facility


.SH STARTUP SCRIPTS
.nf
Linux              |   SmartOS
-------------------|--------------
/etc/rc* (varies)  | smf(5)
                   | svcadm(1M)
                   | svcs(1)
init(8)            | init(1M)
/etc/init.d/       | /etc/rc*
                   | /etc/init.d
.fi

.SH START/STOP/CONFIG SERVICES
.nf
Linux                |   SmartOS
---------------------|---------------
service(8) (rh,ub)   |   svcs(1)
chkconfig (rh)       |
invoke-rc.d(8)       |   svcadm(1M)
sysv-rc-conf (deb)   |   
update-rc.d(8) (ub)  |   svccfg(1M) 
.fi


.SH MANAGING USERS
.nf

Linux        |   SmartOS
-------------|---------------
useradd(8)   |   useradd(1M)
usermod(8)   |   usermod(1M)
userdel(8)   |   userdel(1M)
adduser(8)   |   getent(1M)
chage(1)     |   logins(1M)
getent(1)    |   groupadd(1M)
.fi
.SH LIST HARDWARE CONFIGURATION
.nf

Linux              |   SmartOS
-------------------|--------------
arch(1)            |   arch(1)
uname(1)           |   uname(1) 
dmesg(1)           |   psrinfo(1M) [-v]
cat /var/log/dmesg |   isainfo(1)  [-v]
/proc/*            |   dmesg(1M)
lshw(1)            |   iostat(1M)  [-En]
dmidecode(8)       |
lspci(8)           |
lspnp(8)           |
lsscsi(8)          |
lsusb(8)           |
lsmod(8)           |
hwinfo (SUSE)      |
/sys/devices/*     | 
.fi

.SH KERNEL COMMANDS
Kernel module files are not visible within a zone.
lilo, grub, /boot/* are not accessible.
.nf

Linux           |   SmartOS
----------------|--------------
proc(5) /proc/* |   sysdef(1M)
/proc/sys/*     |   getconf(1)
sysctl(8)       |   ndd(1M)
lsmod(8)        |   modinfo(1M)
.fi


.SH KILL PROCESS
.nf
Linux        |   SmartOS
-------------|--------------
kill(1)      |   kill(1)
killall(1)   |   pkill(1)
             |   killall(1) <- tries to kill everything - DO NOT USE THIS
.fi

.SH SHUTDOWN / POWER OFF
.nf
Linux                 |   SmartOS
----------------------|--------------
shutdown(8) [-PH now] | shutdown(1M) [-y -g0 -i5]
shutdown -y -g0 -i0   | halt(1M)
halt                  | reboot(1M)
reboot(8)             |
poweroff              | 
.fi

.SH RUN LEVELS
.nf
Linux                    |   SmartOS
-------------------------|--------------
who(1)                   | who(1)
/sbin/runlevel           | who -r  ** not showing zone runlevel 
----------------------------------------
(set in /etc/inittab)    | s,S: single-user
0: halt                  | 1:   sys admin
s,S,1: vendor-dependent  | 2:   multi-user
1: single-user           | 3*:  share NFS
2-5*: multiuser          | 4*:  user-defined
6: reboot                | 5:   power-down if possible
                         | 6:   reboot
.fi


.SH TIME ZONE INFO
.nf
Linux                 |   SmartOS
----------------------|--------------
/usr/share/zoneinfo/  |   /usr/share/lib/zoneinfo
/etc/localtime        |   TIMEZONE(4)
.fi


.SH SET DATE / TIME
.nf
Linux        |   SmartOS
-------------|--------------
ntpdate(8)   | ntpdate(1M)
rdate        | rdate(1M)
netdate      |
.fi



.SH FIREWALL CONFIG
.nf
Linux                        |   SmartOS
-----------------------------|--------------
iptables(8)                  |   ipf(1M)
ipchains                     |   /etc/ipf/ipf.conf
ipfwadm                      |
redhat-config-securitylevel  |

.fi

.SH CHECK SWAP SPACE
.nf
Linux             |   SmartOS
------------------|--------------
swapon(8)         |   swap(1M)
cat /proc/meminfo |   swap -s[h]
cat /proc/swaps   |   swap -l[h]
free(1)           |
.fi

.SH BIND PROCESS TO CPU
.nf
Linux        |   SmartOS
-------------|--------------
taskset(1)   |   pbind(1M)
             |   psrset(1M)
.fi

.SH MEMORY
.nf
Linux        |   SmartOS
-------------|--------------
free(1)      |   prtconf(1M)
freemem      |   zonememstat(1M)
.fi

.SH NORMAL FILESYSTEM
.nf
Linux        |   SmartOS
-------------|--------------
ext2         |   zfs(1M)
ext3         |
ReiserFS     |
.fi

.SH FILE SYSTEM DESCRIPTION
.nf
Linux        |   SmartOS
-------------|--------------
/etc/fstab   |   /ect/vfstab
.fi


.SH CREATE ZEROED FILE OF LENGTH = SIZE
.nf
Linux                                            |   SmartOS
-------------------------------------------------|--------------
dd if=/dev/zero of=filename bs=1024 count=size   | mkfile(1M)
.fi

.SH ACL MANAGEMENT
.nf
Linux        |   SmartOS
-------------|--------------
getfacl(1)   |  getfacl(1)
setfacl(1)   |  setfacl(1)

.fi


.SH NFS INFORMATION
SmartOS Zones are not able to export/share NFS mounts as hosts.
They can mount NFS shares.

.nf
Linux            |    SmartOS
-----------------|------------
cat /proc/mounts |    nfsstat(1M)
.fi


.SH NAME RESOLUTION ORDER
.nf
Linux              |   SmartOS
-------------------|--------------
/etc/nsswitch.conf |  /etc/nsswitch.conf
/etc/resolv.conf   |  getent(1M)
.fi


.SH SHOW NETWORK INTERFACE INFO

Note that Joyent Public Cloud IP addresses are set in the
Cloud Management Portal, or at the Global Zone level.

.nf
Linux        |   SmartOS
-------------|--------------
ifconfig(8)  |   dladm(1M)
ethtool      |   ndd(1M)
             |   ifconfig(1M) [-a]
             |   netstat(1M) [-in]
.fi


.SH SNIFF NETWORK
.nf
Linux        |   SmartOS
-------------|--------------
etherfind    |   snoop(1M)
tcpdump(8)   |   tcpdump (Install with pkgin)
wireshark    |   dtrace(1M)
etherape     |
.fi


.SH ROUTE DEFINITIONS
.nf
Linux                                     |   SmartOS
------------------------------------------|--------------
route(8)                                  |   route(1M)
/etc/sysconfig/network (rh,fed)           |   /etc/defaultrouter
/etc/sysconfig/static-routes (rh,fed)     |   /etc/notrouter
/etc/init.d/network (ub,deb)              |   /etc/gateways
/etc/network (ub,deb)                     |   in.routed
                                          |   netstat -r

.fi


.SH AUDITING
.nf
Linux            |   SmartOS
-----------------|--------------
auditd           |   audit(1M)
/var/log/faillog |   auditd(1M)
                 |   auditreduce(1M)
                 |   praudit(1M)
.fi


.SH PASSWORD LENGTH AND ROTATION SETTINGS
.nf
Linux                   |   SmartOS
------------------------|--------------
/etc/pam.d/system-auth  |   /etc/default.login
.fi


.SH C COMPILER
.nf
Linux        |   SmartOS
-------------|--------------
gcc          |   gcc (Install with pkgin)
.fi

.SH CONFIGURE/SHOW RUNTIME LINKING
SmartOS supports both 32-bit and 64-bit compiled executables
.nf
Linux        |   SmartOS
-------------|--------------
ldconfig(8)  |   crle(1)
ldd(1)       |   ldd(1)
readelf(1)   |   elfdump(1)
lsmod (8)    |   dump(1)
             |   pldd(1)
             |   modinfo(1M)
             |   LD_PRELOAD
.fi


.SH LINK LIBRARY PATH
.nf
Linux             |   SmartOS
------------------|--------------
$LD_LIBRARY_PATH  |   $LD_LIBRARY_PATH
/etc/ld.so.conf   | 

.fi


.SH TRACING UTILITY
.nf
Linux        |   SmartOS
-------------|--------------
strace(1)    |   dtrace(1M)
ltrace(1)    |   truss(1)
             |   sotruss(1)
.fi


.SH DEFINE USER DEFAULTS
.nf
Linux               |   SmartOS
--------------------|--------------
/etc/profile        |   /etc/default/login
/etc/security/      |   /etc/profile
/etc/skel/          |   /etc/security/
/etc/profile.d/*    |

.fi


.SH CSH GLOBAL LOGIN
.nf
Linux            |   SmartOS
-----------------|--------------
/etc/csh.login   |   /etc/.login  
.fi



.SH DEFAULT SYSLOG AND MESSAGES
.nf
Linux               |   SmartOS
--------------------|--------------
/var/log/syslog     |   /var/adm/messages 
/var/log/messages   |   /var/log/syslog
/usr/adm/messages   | 
/var/log/maillog    |
.fi



.SH SYSTEM ERROR/FAULT REPORTING TOOL
.nf
Linux        |   SmartOS
-------------|--------------
dmesg (deb)  |   fmadm(1M)    Fault Management Administration
reportbug    |   fmdump(1M)   Fault Management Dump
.fi


.SH PERFORMANCE MONITORING
.nf
Linux        |   SmartOS
-------------|--------------
vmstat(8)    |   dtrace(1M)   dynamic tracing compiler and tracing utility
procinfo -D  |   prstat(1M)   Process Statistics
top(1)       |   
htop         |   
pstree(1)    |   ptree(1)
             |   kstat(1M)     Kernel Statistics
             |   mpstat(1M)    CPU Statistics
             |   netstat(1M)   Network Status
             |   nfsstat(1M)   NFS Statistics
             |   vmstat(1M)    Memory Statistics
             |   plockstat(1M) User-Level Lock/Contention Statistics
             |   vfsstat(1M)   Virtual FileSystem Statistics

.fi



.SH MATCH PROCESS TO FILE OR PORT
.nf
Linux              |   SmartOS
-------------------|--------------
lsof(8)            |   pfiles(1)
netstat(8) -atup   |   fuser(1M)

.fi



.SH RELATED INFORMATION
.nf

.fi
Man page adapted from material on the SmartOS Wiki:
.PP
http://wiki.smartos/org/display/DOC/The+Linux+to+SmartOS+Cheat+Sheet
.PP
Originally Derived from 
.B A Sysadmin's Universal Translator (ROSETTA STONE)
http://bhami.com/rosetta.html 
.PP

.SH AUTHORS
Jason Davis, Max Bruning, Christopher Hogue  
