TritonDataCenter/smartos-live/man/man/man5/cheatsheet.5
.\" te
.\"  Copyright (c) 2013, Joyent, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing. See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CheatSheet 5 "27 May 2013" "SmartOS" "Linux to SmartOS Cheat Sheet"
.SH NAME
.B Linux to SmartOS Zone CheatSheet
.P
.SH SYNOPSIS
.B CheatSheet 
For Mapping \fBLinux\fR 
.I man
commands to \fBSmartOS\fR 
.I man 
commands


.SH AVAILABILITY
Applies Within A SmartOS Zone 
.B = SmartMachine Virtual Instance
.P
This CheatSheet \fBdoes not apply to the SmartOS Global Zone\fR.
.nf

Linux Specific Key
(rh)    Red Hat, CentOS
(deb)   Debian
(ub)    Ubuntu
(fed)   Fedora
(SUSE)  SUSE

.fi

Linux man section (1) are executable or shell commands, whereas section (8) specifies 
system administration commands that are run by root. SmartOS man pages are (1) for general
commands or (1M) for commands and daemons that are primarily used for system maintenance 
and administrative purposes.


.SH DESCRIPTION
SmartOS is an open source illumOS operating system distribtuion provided by Joyent.
It is optimized for enterprise grade cloud-based hypervisor services. illumOS based 
operating systems are forked from OpenSolaris. SmartOS is licensed under the 
Common Development and Distribution License (CDDL). 
.P
http://smartos.org
.P
The following is a list of commands to help Linux users find equivalent 
commands 
in SmartOS Zones and SmartMachines. 
.P
The things that make a SmartMachine different from other Unix-like systems 
generally fall in two categories:
.P
- Similar commands with different names in SmartOS.
.P
- Different procedures for accomplishing similar things in SmartOS.
.P
Many commands available on Linux are also available on SmartOS.
.P
For instance, you can use the \fBpkgin\fR package manager to install \fBtop\fR(1).
.P
\fB# pkgin install top\fR


.SH EXAMPLES OF DIFFERENT USE CONTEXT IN SmartOS
Some common GNU/Linux commands have context differences in SmartOS/illumOS.
.PP
Some appear the same but have different use contexts and command-line parameters. 
Certain commands will be unsupported, but alternative commands are available
to provide similar functionality. Other commands may found and installed through 
the package management system pkgin, but the illumOS versions are reccommended.
.PP
.nf

Linux    |   SmartOS
Command  |   Difference
---------|------------------------------------------------------
df(1)    |   \fBdf\fR(1M)
         |   Native illumOS version is /usr/bin/df    
         | # \fBdf -t /usr\fR  (Prints free and totals)
---------|------------------------------------------------------
ping(8)  |   \fBping\fR(1M)
         |   Returns whether a host responds or not.
         | # \fBping -s\fR   (Returns a coninuous response)
----------------------------------------------------------------
lsof(8)  |   lsof -  list of open files - command not provided.
         |   \fBproc\fR(1) has commands like pfiles to show files
         |   open for a list of process IDs.
         | # \fBpfiles $(pgrep bash)\fR   (Files associated with bash)
         |   See ADDITIONAL TOOLS AND SCRIPTS for \fBsm-lsof\fR
---------|------------------------------------------------------
top(1)   |   \fBprstat\fR(1M) is zone aware and more accurate.
         |   top is available via pkgin
         | # \fBpkgin -y install top\fR   (Installs top)
-----------------------------------------------------------------        
.fi


.SH SmartOS PROCESS TOOLS PROC(1)
The SmartOS \fBproc\fR(1) man page 
describes the suite of tools used to examine processes.
.PP
.nf

SmartOS
Tool     |  Description
---------|---------------------------------------------------------------
\fBprstat\fR   |  Displays active processes - like top
         |# \fBprstat -Z\fR   (Prints summary of status)
         |# \fBprstat -p $(pgrep -d ',' login)\fR  (Displays 'login' processes)
         |# \fBprstat -P 0\fR  (Displays processes on cpu0)
---------|---------------------------------------------------------------
\fBpgrep\fR    |  Returns a list of process IDs (PIDs) that match 
         |  a pattern or meet certain conditions
         |# \fBpgrep -G root\fR  (Displays PIDs owned by root group)
---------|---------------------------------------------------------------
\fBpkill\fR    |  Kills processes that match a pattern or meet
         |  certain conditions
---------|---------------------------------------------------------------
\fBpfiles\fR   |  Returns a list of all the open files that belong 
         |  to a process
---------|---------------------------------------------------------------
\fBpstack\fR   |  Displays a stack trace of the specified process
         |
---------|---------------------------------------------------------------
\fBptree\fR    |  Displays a process tree for all processes of a given 
         |  process
---------|---------------------------------------------------------------
\fBls /proc\fR |  Lists the PIDs of all running processes
         |
---------|---------------------------------------------------------------

.fi
.B Note:
If \fBprstat\fR display changes your terminal settings,
use the
.B \fBreset\fR
command to return them to normal.


.SH INSTALLING SOFTWARE - SmartOS PACKAGE MANAGEMENT
.SH SHOW/SEARCH/INSTALL/UPDATE SOFTWARE PACKAGES
The pkgin system is used for managing software packages.
.P
Over 10,000 software packages are available.
.P
Packages are retrieved from the Joyent pkgsrc repository at:
.P
.B pkgsrc.joyent.com/packages/
.nf

Linux                  |   SmartOS
-----------------------|----------------
apt-get(8) (deb, ub)   |   \fBpkgin\fR(1)
yum(8)  (rh, fed)      |   
rpm(8)   (rh, fed)     |
dpkg(1) (deb, ub)      |
dselect (deb)          |


\fBpkgin\fR                          Show all pkgin commands 
\fBpkgin update\fR (Do this first)   Update current packages  
\fBpkgin list\fR                     Show installed software
\fBpkgin avail\fR                    List available software       
\fBpkgin search \fR...               Search for software ...      
\fBpkgin install \fR...              Install software ...         
\fBpkgin in -y \fR...                Install with prejudice ...  

.fi


.SH MANAGING SmartOS SERVICES WITH THE SERVICE MANAGEMENT FACILITY
The Service Management Facility (\fBSMF\fR) is the SmartOS way to start and stop 
services (web, database, email, and so on) and provides two advantages:
.P
- It monitors services and restarts them automatically if they stop running.
.P
- It understands the dependencies between services. For example, SMF will not 
attempt to start your webserver if your network is down.
.P
The \fBSMF\fR facility in SmartOS is used to manage long running daemon processes like 
\fBApache and MySQL\fR. Most of the relevant packages from the pkgin repository 
(pkgsrc) will come with a corresponding SMF manifest and do not require any 
interaction on your part other than enabling the service for the installed 
package (see svcadm). However, you may find a need for importing a manifest that 
manages a service you have custom compiled or created yourself.
.P
.B SMF consists of four command-line utilities:
.nf

\fBsvcs\fR(1)       Examine the state of your services
\fBsvcadm\fR(1M)    Enable, disable, and restart a service
\fBsvccfg\fR(1M)    Load XML manifest file with service configuration data
\fBsvcprop\fR(1)    Retrieves service properties (use for custom scripts)
.fi
.P
For more details visit: 
.P
.B http://wiki.smartos.org/display/DOC/Using+the+Service+Management+Facility


.SH STARTUP SCRIPTS
.nf
Linux              |   SmartOS
-------------------|--------------
/etc/rc* (varies)  | \fBsmf\fR(5)
                   | \fBsvcadm\fR(1M)
                   | \fBsvcs\fR(1)
init(8)            | \fBinit\fR(1M)
/etc/init.d/       | /etc/rc*
                   | /etc/init.d
.fi

.SH START/STOP/CONFIGURE SERVICES
.nf
Linux                |   SmartOS
---------------------|---------------
service(8) (rh,ub)   |   \fBsvcs\fR(1)
chkconfig (rh)       |
invoke-rc.d(8)       |   \fBsvcadm\fR(1M)
sysv-rc-conf (deb)   |   
update-rc.d(8) (ub)  |   \fBsvccfg\fR(1M) 
.fi


.SH MANAGING PRROCESS RESOURCE USE AND AUTHENTICATION WITH PROJECTS(1)
A facility in illumOS/OpenSolaris allows grouping of processes for the purpose of controlling
and limiting their access to resources like CPU, memory and storage. Users and groups can be
specified for project membership. The man page for \fBresource_controls\fR(5) describes the specific
resources that can be controlled under the \fBprojects\fR(1) facility.
.P
The \fBprojects\fR(1) facility involves command-line tools required to operate on the local project 
file at /etc/project as described in \fBproject\fR(4). 
.P
.nf 

\fBprojadd\fR(1M) Adds a project to the system project database
\fBprojdel\fR(1M) Deletes a project from the system    
\fBprojmod\fR(1M) Modifies project resource and authentication, with examples
\fBnewtask\fR(1)  Sets, associates and launches processes within projects
\fBprctl\fR(1)    Get, set resources of running processes, tasks or projects

.fi

.SH MANAGING USERS AND GROUPS
.nf

Linux        |   SmartOS
-------------|---------------
useradd(8)   |   \fBuseradd\fR(1M)
usermod(8)   |   \fBusermod\fR(1M)
userdel(8)   |   \fBuserdel\fR(1M)
adduser(8)   |   \fBgetent\fR(1M)
chage(1)     |   \fBlogins\fR(1M)
getent(1)    |   \fBgroupadd\fR(1M)
             |   \fBgroupdel\fR(1M)
             |   \fBgroupmod\fR(1M)
.fi

.SH LIST HARDWARE CONFIGURATION
.nf

Linux              |   SmartOS
-------------------|--------------
arch(1)            |   \fBarch\fR(1)
uname(1)           |   \fBuname\fR(1) 
dmesg(1)           |   \fBpsrinfo\fR(1M) [-v]
cat /var/log/dmesg |   \fBisainfo\fR(1)  [-v]
/proc/*            |   \fBdmesg\fR(1M)
lshw(1)            |   \fBiostat\fR(1M)  [-En]
dmidecode(8)       |
lspci(8)           |
lspnp(8)           |
lsscsi(8)          |
lsusb(8)           |
lsmod(8)           |
hwinfo (SUSE)      |
/sys/devices/*     | 
.fi

.SH KERNEL COMMANDS
Kernel module files are not visible within a zone.
lilo, grub, /boot/* are not accessible.
.nf

Linux           |   SmartOS
----------------|--------------
proc(5) /proc/* |   \fBsysdef\fR(1M)
/proc/sys/*     |   \fBgetconf\fR(1)
sysctl(8)       |   \fBndd\fR(1M)
lsmod(8)        |   \fBmodinfo\fR(1M)
.fi

.SH TYPICAL $PATH FOR ROOT
.P
Linux (ub):
.P
 /usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:
.P
SmartOS:
.P
.B /opt/local/bin:/opt/local/sbin:/usr/bin:/usr/sbin:
.P

.SH KILL PROCESS
.nf
Linux        |   SmartOS
-------------|--------------
kill(1)      |   \fBkill\fR(1)
killall(1)   |   \fBpkill\fR(1)
             |   killall(1) <- tries to kill everything - DO NOT USE THIS
.fi

.SH SHUTDOWN / POWER OFF
.nf
Linux                 |   SmartOS
----------------------|--------------
shutdown(8) [-PH now] | \fBshutdown\fR(1M) [\fB-y -g0 -i5\fR]
shutdown -y -g0 -i0   | \fBhalt\fR(1M)
halt                  | \fBreboot\fR(1M)
reboot(8)             |
poweroff              | 
.fi

.SH RUN LEVELS
.nf
Linux                    |   SmartOS
-------------------------|--------------
who(1)                   | \fBwho\fR(1)
/sbin/runlevel           | \fBwho -r\fR  ** Does not show zone runlevel 
----------------------------------------
(set in /etc/inittab)    | \fBs,S: single-user\fR
0: halt                  | \fB1:   sys admin\fR
s,S,1: vendor-dependent  | \fB2:   multi-user\fR
1: single-user           | \fB3*:  share NFS\fR
2-5*: multiuser          | \fB4*:  user-defined\fR
6: reboot                | \fB5:   power-down if possible\fR
                         | \fB6:   reboot\fR
.fi


.SH TIME ZONE INFORMATION
.nf
Linux                 |   SmartOS
----------------------|--------------
/usr/share/zoneinfo/  |   \fB/usr/share/lib/zoneinfo\fR
/etc/localtime        |   \fBTIMEZONE\fR(4)
.fi


.SH SET DATE / TIME
.nf
Linux        |   SmartOS
-------------|--------------
ntpdate(8)   | \fBntpdate\fR(1M)
rdate        | \fBrdate\fR(1M)
netdate      |
.fi



.SH FIREWALL CONFIGURATION
.nf
Linux                        |   SmartOS
-----------------------------|--------------
iptables(8)                  |   \fBipf\fR(1M)
ipchains                     |   \fB/etc/ipf/ipf.conf\fR
ipfwadm                      |
redhat-config-securitylevel  |

.fi

.SH CHECK SWAP SPACE
.nf
Linux             |   SmartOS
------------------|--------------
swapon(8)         |   \fBswap\fR(1M)
cat /proc/meminfo |   \fBswap -s\fR[h]
cat /proc/swaps   |   \fBswap -l\fR[h]
free(1)           |
.fi

.SH BIND PROCESS TO CPU
.nf
Linux        |   SmartOS
-------------|--------------
taskset(1)   |   \fBpbind\fR(1M)
             |   \fBpsrset\fR(1M)
.fi

.SH MEMORY
.nf
Linux        |   SmartOS
-------------|--------------
free(1)      |   \fBprtconf\fR(1M)
freemem      |   \fBzonememstat\fR(1M)
.fi

.SH NORMAL FILESYSTEM
.nf
Linux        |   SmartOS
-------------|--------------
ext2         |   \fBzfs\fR(1M)
ext3         |
ReiserFS     |
.fi

.SH FILE SYSTEM DESCRIPTION
.nf
Linux        |   SmartOS
-------------|--------------
/etc/fstab   |   \fB/etc/vfstab\fR
.fi


.SH CREATE ZEROED FILE OF LENGTH = SIZE
.nf
Linux                                            |   SmartOS
-------------------------------------------------|--------------
dd if=/dev/zero of=filename bs=1024 count=size   | \fBmkfile\fR(1M)
.fi

.SH ACL MANAGEMENT
.nf
Linux        |   SmartOS
-------------|--------------
getfacl(1)   |  \fBgetfacl\fR(1)
setfacl(1)   |  \fBsetfacl\fR(1)

.fi


.SH NFS INFORMATION
SmartOS Zones are not able to export/share NFS mounts as hosts.
They can mount NFS shares.

.nf
Linux            |    SmartOS
-----------------|------------
cat /proc/mounts |    \fBnfsstat\fR(1M)
.fi


.SH NAME RESOLUTION ORDER
.nf
Linux              |   SmartOS
-------------------|--------------
/etc/nsswitch.conf |  \fB/etc/nsswitch.conf\fR
/etc/resolv.conf   |  \fBgetent\fR(1M)
.fi


.SH SHOW NETWORK INTERFACE INFO

Joyent Public Cloud, IP addresses are set in the
Cloud Management Portal, SmartOS Zone IPs are set in the Global Zone.

.nf
Linux        |   SmartOS
-------------|--------------
ifconfig(8)  |   \fBdladm\fR(1M)
ethtool      |   \fBndd\fR(1M)
             |   \fBifconfig\fR(1M) [-a]
             |   \fBnetstat\fR(1M) [-in]
.fi


.SH SNIFF NETWORK
.nf
Linux        |   SmartOS
-------------|--------------
etherfind    |   \fBsnoop\fR(1M)
tcpdump(8)   |   \fBtcpdump\fR (Install with pkgin)
wireshark    |   \fBdtrace\fR(1M)
etherape     |
.fi


.SH ROUTE DEFINITIONS
.nf
Linux                                     |   SmartOS
------------------------------------------|--------------
route(8)                                  |   \fBroute\fR(1M)
/etc/sysconfig/network (rh,fed)           |   \fB/etc/defaultrouter\fR
/etc/sysconfig/static-routes (rh,fed)     |   \fB/etc/notrouter\fR
/etc/init.d/network (ub,deb)              |   \fB/etc/gateways\fR
/etc/network (ub,deb)                     |   \fBin.routed\fR
                                          |   \fBnetstat -r\fR

.fi


.SH AUDITING
.nf
Linux            |   SmartOS
-----------------|--------------
auditd           |   \fBaudit\fR(1M)
/var/log/faillog |   \fBauditd\fR(1M)
                 |   \fBauditreduce\fR(1M)
                 |   \fBpraudit\fR(1M)
.fi


.SH PASSWORD LENGTH AND ROTATION SETTINGS
.nf
Linux                   |   SmartOS
------------------------|--------------
/etc/pam.d/system-auth  |   \fB/etc/default.login\fR
.fi


.SH C COMPILER
.nf
Linux        |   SmartOS
-------------|--------------
gcc          |   \fBgcc\fR (Install with pkgin)
.fi

.SH CONFIGURE/SHOW RUNTIME LINKING
SmartOS supports both 32-bit and 64-bit compiled executables.
.nf
Linux        |   SmartOS
-------------|--------------
ldconfig(8)  |   \fBcrle\fr(1)
ldd(1)       |   \fBldd\fR(1)
readelf(1)   |   \fBelfdump\fR(1)
lsmod (8)    |   \fBdump\fR(1)
             |   \fBpldd\fR(1)
             |   \fBmodinfo\fR(1M)
             |   \fBLD_PRELOAD\fR
.fi


.SH LINK LIBRARY PATH
.nf
Linux             |   SmartOS
------------------|--------------
$LD_LIBRARY_PATH  |   \fB$LD_LIBRARY_PATH\fR
/etc/ld.so.conf   | 

.fi


.SH TRACING UTILITY
.nf
Linux        |   SmartOS
-------------|--------------
strace(1)    |   \fBdtrace\fR(1M)
ltrace(1)    |   \fBtruss\fR(1)
             |   \fBsotruss\fR(1)
.fi


.SH DEFINE USER DEFAULTS
.nf
Linux               |   SmartOS
--------------------|--------------
/etc/profile        |   \fB/etc/default/login\fR
/etc/security/      |   \fB/etc/profile\fR
/etc/skel/          |   \fB/etc/security/\fR
/etc/profile.d/*    |

.fi


.SH CSH GLOBAL LOGIN
.nf
Linux            |   SmartOS
-----------------|--------------
/etc/csh.login   |   \fB/etc/.login\fR 
.fi



.SH DEFAULT SYSLOG AND MESSAGES
.nf
Linux               |   SmartOS
--------------------|--------------
/var/log/syslog     |   \fB/var/adm/messages\fR
/var/log/messages   |   \fB/var/log/syslog\fR
/usr/adm/messages   | 
/var/log/maillog    |
.fi


.SH SYSTEM ERROR/FAULT REPORTING TOOL
.nf
Linux        |   SmartOS
-------------|--------------
dmesg (deb)  |   \fBfmadm\fR(1M)    Fault Management Administration
reportbug    |   \fBfmdump\fR(1M)   Fault Management Dump
.fi


.SH PERFORMANCE MONITORING
.nf
Linux        |   SmartOS
-------------|--------------
vmstat(8)    |   \fBdtrace\fR(1M)    Dynamic tracing compiler and utility
procinfo -D  |   \fBprstat\fR(1M)    Process Statistics
top(1)       |   
htop         |   
pstree(1)    |   \fBptree\fR(1)
             |   \fBkstat\fR(1M)     Kernel Statistics
             |   \fBmpstat\fR(1M)    CPU Statistics
             |   \fBnetstat\fR(1M)   Network Status
             |   \fBnfsstat\fR(1M)   NFS Statistics
             |   \fBvmstat\fR(1M)    Memory Statistics
             |   \fBplockstat\fR(1M) User-Level Lock/Contention Statistics
             |   \fBvfsstat\fR(1M)   Virtual FileSystem Statistics

.fi



.SH MATCH PROCESS TO FILE OR PORT
.nf
Linux              |   SmartOS
-------------------|--------------
lsof(8)            |   \fBpfiles\fR(1)
netstat(8) -atup   |   \fBfuser\fR(1M)

.fi



.SH ADDITIONAL TOOLS AND SCRIPTS FROM PKGIN
The \fBsmtools\fR package can be installed with.
.P
# pkgin in smtools
.P
This provides a number of helpful utilities and scripts, man pages not yet specified.
These are provided for the Joyent Cloud SmartMachines, ymmv on SmartOS Zones.
.P
.B SMARTMACHINE SYSTEM MANAGEMENT SCRIPTS
.nf
\fBsm-summary\fR        Provides summary of information
\fBsm-set-hostname\fR   Set the hostname
\fBsm-cpuinfo\fR        Provides cpu utilization information
\fBsm-meminfo\fR        Provides memory utilization information
\fBsm-set-timezone\fR   Set the timezone
\fBsm-list-timezones\fR List timezones available
\fBsm-reboot\fR         Reboot
\fBsm-shutdown\fR       Shuts down
\fBsm-lsof\fR           lsof command equivalent script for files or ports
\fBsm-rebuild-pkgsrc\fR Re-installs pkgsrc with packages from new package set
\fBsm-pkghelp\fR        Reminder - unknown commands may be obtained via pkgin
.fi


.B SMARTMACHINE DATABASE  - MySQL/PostgreSQL MANAGMENT
.nf
\fBsm-create-dbuser\fR  Create a MySQL/PostgreSQL database user
\fBsm-list-dbs\fR       List MySQL/PostgreSQL databases    
\fBsm-create-db\fR      Create a MySQL/PostgreSQL database
\fBsm-remove-db\fR      Remove a MySQL/PostgreSQL database
\fBsm-list-dbusers\fR   List MySQL/PostgreSQL database users
\fBsm-remove-dbuser\fR  Remove a MySQL/PostgreSQL database
.fi

.B SMARTMACHINE WEB SERVICES INSTALLATION SCRIPTS
.P
\fBsm-create-vhost\fR       Creates simple Apache/Nginx configurations
.P
Commands dependent on sm-create-vhost:
.nf
\fBsm-install-drupal\fR     Installs drupal in destination directory
\fBsm-install-wordpress\fR  Installs wordpress in destination directory
.fi

.B VM IMAGE PREPARATION SCRIPT
.P
.B USE WITH CAUTION - MAKES IRREVERSIBLE CHANGES!
.P
\fBsm-prepare-image\fR   Clean up the filesystem for SmartMachine image 
.P



.SH RELATED INFORMATION
Man page adapted from material on the SmartOS Wiki:
.P
http://wiki.smartos/org/display/DOC/The+Linux+to+SmartOS+Cheat+Sheet
.P
Originally Derived from 
.B A Sysadmin's Universal Translator (ROSETTA STONE)
http://bhami.com/rosetta.html 
.P

.SH AUTHORS
.B Jason Davis, Max Bruning, Christopher Hogue  
