TritonDataCenter/smartos-live/man/man/man5/mms.5
'\" te
.\"  Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH mms 5 "11 Nov 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
mms \- MMS service overview
.SH DESCRIPTION
.sp
.LP
MMS is a distributed removable media management system. It is based on the standard, \fIIEEE 1244, Media Management System (MMS)\fR.
.sp
.LP
The current implementation of MMS manages tapes and cartridges in a Sun StorageTek ACSLS tape library and emulated tapes on a file system. MMS is capable of sharing drives among multiple hosts. An important feature of MMS is that it provides a uniform and consistent tape interface to its client applications.
.sp
.LP
MMS consists of a media manager (MM) which manages the entire MMS system. Information about the system is maintained by MM in a database.
.sp
.LP
Every library managed by MMS has an active library manager (LM). An LM provides library access and mounting service to MMS.
.sp
.LP
A drive managed by MMS has a drive manager (DM) on each host that has access to the drive. A DM provides device specific operations. A DM also provides label processing. The current implementation supports only ANSI labels.
.sp
.LP
MMS client applications request MM to mount and unmount cartridges and process them after they are mounted. Applications use the Media Management Protocol (MMP) to make requests. A library of client application functions is available.
.sp
.LP
The Solaris implementation of the MMS uses the \fBmmsinit\fR(1M) command to configure and start the MMS service and the \fBmmsadm\fR(1M) command to list and set parameters required by the service.
.sp
.LP
The MMS service instances, as reported by \fBsvcs\fR(1), are:
.sp
.ne 2
.mk
.na
\fB\fBmms:wcr\fR\fR
.ad
.sp .6
.RS 4n
watcher
.RE

.sp
.ne 2
.mk
.na
\fB\fBmms:db\fR\fR
.ad
.sp .6
.RS 4n
Media Manager PostgreSQL database
.RE

.sp
.ne 2
.mk
.na
\fB\fBmms:mm\fR\fR
.ad
.sp .6
.RS 4n
Media Manager
.RE

.sp
.LP
The MMS service RBAC (see \fBrbac\fR(5)) authorizations are:
.RS +4
.TP
.ie t \(bu
.el o
\fBsolaris.smf.manage.mms\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBsolaris.smf.value.mms\fR
.RE
.sp
.LP
The following are the MMS service configuration data accessible through the service management facility (see \fBsmf\fR(5)):
.sp
.ne 2
.mk
.na
\fB\fBconfig/type\fR\fR
.ad
.sp .6
.RS 4n
Host is media manager or watcher only. Valid values are \fBserver\fR or \fBclient\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmanager/host\fR\fR
.ad
.sp .6
.RS 4n
Host name where the media manager is running.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmanager/port\fR\fR
.ad
.sp .6
.RS 4n
Port the media manager is using.
.RE

.sp
.ne 2
.mk
.na
\fB\fBssl/enabled\fR\fR
.ad
.sp .6
.RS 4n
Media Manager is using SSL. Valid values are \fBtrue\fR or \fBfalse\fR. Note the Media Manager needs an SSL RSA certificate and Diffie-Hellman parameters must be 'true'.
.RE

.sp
.ne 2
.mk
.na
\fB\fBssl/verify\fR\fR
.ad
.sp .6
.RS 4n
Media Manager-only value, determines whether two-way authentication is enabled, which requires all Media Manager clients to have SSL RSA certificate. Valid values are are \fBtrue\fR for two-way authentication and \fBfalse\fR for one-way authentication.
.RE

.sp
.ne 2
.mk
.na
\fB\fBssl/cert_file\fR\fR
.ad
.sp .6
.RS 4n
Name of file that contains the SSL RSA certificate, private key, and RSA certificate chain.
.RE

.sp
.ne 2
.mk
.na
\fB\fBssl/pass_file\fR\fR
.ad
.sp .6
.RS 4n
Name of file for the private key password phrase if the RSA certificate is encrypted.
.RE

.sp
.ne 2
.mk
.na
\fB\fBssl/dh_file\fR\fR
.ad
.sp .6
.RS 4n
Media Manager-only value, name of file that stores the Diffie-Hellman parameters.
.RE

.sp
.ne 2
.mk
.na
\fB\fBssl/crl_file\fR\fR
.ad
.sp .6
.RS 4n
Name of optional CRL file.
.RE

.sp
.ne 2
.mk
.na
\fB\fBssl/cipher\fR\fR
.ad
.sp .6
.RS 4n
Optional cipher change from \fBEDH-RSA-DES-CBC3-SHA\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBssl/peer_file\fR\fR
.ad
.sp .6
.RS 4n
Optional client only, name of file that stores the media manager certificate. The certificate is checked against the certificate returned by \fBSSL_get_peer_certificate()\fR function.
.RE

.sp
.LP
The following are the MMS Database fault management resource identifier (FMRI) configuration data:
.sp
.ne 2
.mk
.na
\fB\fBpostgresql/bin\fR\fR
.ad
.sp .6
.RS 4n
Directory where the PostgreSQL binaries are located. The directory is specific to the version of PostgreSQL qualified for use by the MMS software.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpostgresql/data\fR\fR
.ad
.sp .6
.RS 4n
Directory where the PostgreSQL database is located. The default location is  a version-specific subdirectory of \fB/var/mms/db\fR.
.RE

.sp
.LP
The following are the MMS Media Manager FMRI configuration data:
.sp
.ne 2
.mk
.na
\fB\fBdb/host\fR\fR
.ad
.sp .6
.RS 4n
For future use. Set to \fBlocalhost\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdb/port\fR\fR
.ad
.sp .6
.RS 4n
Port number to use for PostgreSQL login. The default value is \fB7656\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdb/user\fR\fR
.ad
.sp .6
.RS 4n
PostgreSQL user name. The default user name is \fBpostgres\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdb/name\fR\fR
.ad
.sp .6
.RS 4n
Name of PostgreSQL database to which to connect. The default value is \fBmms\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoption/trace\fR\fR
.ad
.sp .6
.RS 4n
Optional. The Media Manager trace level before connecting to the PostgreSQL database.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoption/db_reconnect_max_retry\fR\fR
.ad
.sp .6
.RS 4n
Number of times to wait for the database to accept a Media Manager connection.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoption/db_reconnect_timeout\fR\fR
.ad
.sp .6
.RS 4n
Number of seconds to wait  between reconnect tries.
.RE

.sp
.LP
The following are the MMS Watcher FMRI configuration data:
.sp
.ne 2
.mk
.na
\fB\fBoption/ssi_path\fR\fR
.ad
.sp .6
.RS 4n
Path to ACSLS SSI daemon.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoption/libapi_path\fR\fR
.ad
.sp .6
.RS 4n
Path to ACSLS API library.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBmmsadm\fR(1M), \fBmmsclient\fR(1M), \fBmmsexplorer\fR(1M), \fBmmsinit\fR(1M), \fBmmsclient_script\fR(4), \fBattributes\fR(5), \fBrbac\fR(5), \fBsmf\fR(5)
