TritonDataCenter/smartos-live/man/man/man4/cdtoc.4
'\" te
.\"  Copyright (c) 1996, Sun Microsystems, Inc.
.\"  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH cdtoc 4 "14 Sept 2004" "SunOS 5.11" "File Formats"
.SH NAME
cdtoc \- CD-ROM table of contents file
.SH DESCRIPTION
.sp
.LP
The table of contents file, \fB\&.cdtoc\fR, is an \fBASCII\fR file that describes the contents of a \fBCD-ROM\fR or other software distribution media. It resides in the top-level directory of the file system on a slice of a CD-ROM. It is independent of file system format, that is, the file system on the slice can be either \fBUFS\fR or \fBHSFS\fR.
.sp
.LP
Each entry in the \fB\&.cdtoc\fR file is a line that establishes the value of a parameter in the following form:
.sp
.LP
\fIPARAM\fR\fB=\fR\fIvalue\fR
.sp
.LP
Blank lines and comments (lines preceded by a pound-sign, ``#'') are also allowed in the file. Parameters are grouped by product, with the beginning of a product defined by a line of the form:
.sp
.LP
\fIPRODNAME\fR\fB=\fR\fIvalue\fR
.sp
.LP
Each product is expected to consist of one or more software packages that are stored together in a subdirectory on the distribution media. There can be any number of products described within the file. There is no required order in which the parameters must be specified, except that the parameters must be grouped by product and the \fIPRODNAME\fR parameter must appear first in the list of parameters for each product specified. Each parameter is described below. All of the parameters are required for each product.
.sp
.ne 2
.mk
.na
\fB\fIPRODNAME\fR\fR
.ad
.RS 12n
.rt  
The full name of the product. This must be unique within the \fB\&.cdtoc\fR file and is preferably unique across all possible products. This value may contain white space. The length of this value is limited to \fB256\fR \fBASCII\fR characters; other restrictions may apply (see below).
.RE

.sp
.ne 2
.mk
.na
\fB\fIPRODVERS\fR\fR
.ad
.RS 12n
.rt  
The version of the product. The value can contain any combination of letters, numbers, or other characters. This value may contain white space. The length of this value is limited to \fB256\fR \fBASCII\fR characters; other restrictions may apply (see below).
.RE

.sp
.ne 2
.mk
.na
\fB\fIPRODDIR\fR\fR
.ad
.RS 12n
.rt  
The name of the top-level directory containing the product. This name should be relative to the top-level directory of the distribution media, for example, \fBSolaris_2.6/Product\fR. The number of path components in the name is limited only by the system's maximum path name length, which is 1024 \fBASCII\fR characters. Any single component is limited to \fB256\fR \fBASCII\fR characters. This value cannot contain white space.
.RE

.sp
.LP
The lengths of the values of \fIPRODNAME\fR and \fIPRODVERS\fR are further constrained by the fact that the initial install programs concatenate these values to produce the full product name. For unbundled products the combined length of the values of \fIPRODNAME\fR and \fIPRODVERS\fR must not exceed \fB256\fR \fBASCII\fR characters.
.sp
.LP
When you install \fBOS\fR services with Solstice Host Manager, directories for diskless clients are created by constructing names derived from a concatenation of the values of \fIPRODNAME\fR, \fIPRODVERS\fR, and client architecture, for example, \fB/export/exec/Solaris_2.\fIx\fR_sparc.all/usr/platform\fR. The length of the component containing the product name and version must not exceed \fB256\fR \fBASCII\fR characters. Thus, for products corresponding to bundled \fBOS\fR releases (for example, Solaris 2.4), the values of \fIPRODNAME\fR and \fIPRODVERS\fR are effectively restricted to lengths much less than \fB256\fR.
.sp
.LP
The initial install programs use the value of the \fIPRODDIR\fR macro in the \fB\&.cdtoc\fR file to indicate where packages can be found.
.SH EXAMPLES
.LP
\fBExample 1 \fRSample of \fB\&.cdtoc\fR file.
.sp
.LP
Here is a sample \fB\&.cdtoc\fR file:

.sp
.in +2
.nf
     
        #
        # .cdtoc file -- Online product family CD
        #
        PRODNAME=Online DiskSuite
        PRODVERS=2.0
        PRODDIR=Online_DiskSuite_2.0
        #
        PRODNAME=Online Backup
        PRODVERS=2.0
        PRODDIR=Online_Backup_2.0
.fi
.in -2
.sp

.sp
.LP
This example corresponds to the following directory layout on a \fBCD-ROM\fR partition:

.sp
.in +2
.nf
        /.cdtoc
        /Online_DiskSuite_2.0
              ./SUNWmddr.c
              ./SUNWmddr.m
              ./SUNWmddu
        /Online_Backup_2.0
              ./SUNWhsm
.fi
.in -2
.sp

.sp
.LP
The bundled release of Solaris 2.6 includes the following \fB\&.cdtoc\fR file:

.sp
.in +2
.nf
        PRODNAME=Solaris
        PRODVERS=2.6
        PRODDIR=Solaris_2.6/Product
.fi
.in -2
.sp

.sp
.LP
This file corresponds to the following directory layout on slice 0 of the Solaris 2.6 product \fBCD\fR:

.sp
.in +2
.nf
        /.cdtoc
        /Solaris_2.6/Product
             ./SUNWaccr
             ./SUNWaccu
             ./SUNWadmap
             .
             .
             .
             ./SUNWutool
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
\fBclustertoc\fR(4), \fBpackagetoc\fR(4), \fBpkginfo\fR(4) 
