TritonDataCenter/smartos-live/man/man/man4/nisfiles.4
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH nisfiles 4 "18 Dec 2001" "SunOS 5.11" "File Formats"
.SH NAME
nisfiles \- NIS+ database files and directory structure
.SH SYNOPSIS
.LP
.nf
\fB/var/nis\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Network Information Service Plus (NIS+) uses a memory based, replicated database. This database uses a set of files in the \fB/var/nis\fR directory for checkpointing to table storage and for maintaining a transaction log. Additionally, the NIS+ server and client use files in this directory to store binding and state information.
.sp
.LP
The NIS+ service implements an authentication and authorization system that is built upon Secure RPC. In this implementation, the service uses a table named \fBcred.org_dir.\fR\fIdomain-name\fR to store the public and private keys of principals that are authorized to access the NIS+ namespace. It stores group access information in the subdomain \fBgroups_dir.\fR\fIdomain-name\fR as \fIgroup\fR objects. These two tables appear as files in the \fB/var/nis/data\fR directory on the NIS+ server.
.sp
.LP
Unlike the previous versions of the network information service, in NIS+, the information in the tables is initially loaded into the service from the \fBASCII\fR files on the server and then updated using NIS+ utilities. See \fBnistbladm\fR(1). Some sites may wish to periodically regenerate the \fBASCII\fR files for archival purposes. To do this, a script should be added in the \fBcrontab\fR(1) of the server that lists these tables and creates the \fB ASCII\fR file from the result.
.sp
.LP
Note that except for the \fBNIS_COLDSTART\fR and \fBNIS_SHARED_DIRCACHE\fR file, no other files should be manipulated by commands such as \fBcp\fR(1), \fBmv\fR(1) or \fBrm\fR(1). The transaction log file keeps logs of all changes made, and hence the files cannot be manipulated independently.
.sp
.LP
The files described below are stored in the \fB/var/nis\fR directory:
.sp
.ne 2
.mk
.na
\fB\fBNIS_COLDSTART\fR\fR
.ad
.RS 23n
.rt  
Contains NIS+ directory objects that are to be preloaded into the NIS+ cache at startup time. This file is usually created at NIS+ installation time. See \fBnisinit\fR(1M) or \fBnisclient\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB\fBNIS_SHARED_DIRCACHE\fR\fR
.ad
.RS 23n
.rt  
Contains the current cache of NIS+ bindings being maintained by the cache manager. The contents can be viewed with \fBnisshowcache\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB\fBclient_info\fR\fR
.ad
.RS 23n
.rt  
Contains configuration information, for example, preferred servers, options, and the like, for \fBnis_cachemgr\fR(1M) and potentially other NIS+ clients on the system. It is manipulated by the \fBnisprefadm\fR(1M) command.
.RE

.sp
.ne 2
.mk
.na
\fB\fB\&.pref_servers\fR\fR
.ad
.RS 23n
.rt  
A cached copy of preferred server information. It is maintained by \fBnis_cachemgr\fR. Do not edit this file manually.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtrans.log\fR\fR
.ad
.RS 23n
.rt  
Contains a transaction log that is maintained by the NIS+ service. It can be viewed using the \fBnislog\fR(1M) command. This file contains holes. Its apparent size may be a lot higher than its actual size. There is only one transaction log per server.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata.dict\fR\fR
.ad
.RS 23n
.rt  
A dictionary that is used by the NIS+ database to locate its files. It is created by the default NIS+ database package.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata.dict.log\fR\fR
.ad
.RS 23n
.rt  
The log file for the database dictionary. When the server is checkpointed, this file will be deleted. See the discussion of the \fB-C\fR option of \fBnisping\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata\fR\fR
.ad
.RS 23n
.rt  
Contains databases that the server uses.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata/root.object\fR\fR
.ad
.RS 23n
.rt  
On root servers, this file contains a directory object that describes the root of the name space.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata/parent.object\fR\fR
.ad
.RS 23n
.rt  
On root servers, this file contains a directory object that describes the parent namespace. This file is created by the \fBnisinit\fR(1M) command.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata/\fR\fItable_name\fR\fR
.ad
.RS 23n
.rt  
For each table in the directory there is a file with the same name that stores the information about that table. If there are subdirectories within this directory, the database for the table is stored in the file, \fItable_name\fR.\fIsubdirectory\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata/\fR\fItable_name.log\fR\fR
.ad
.RS 23n
.rt  
Contains the database log for the table \fItable_name\fR. The log file maintains the state of individual transactions to each database. When a database has been checkpointed, that is, all changes have been made to the data/\fItable_name\fR stable storage, this log file will be deleted.
.sp
Currently, NIS+ does not automatically do checkpointing. The system administrator may want to do \fBnisping\fR\fB-C\fR operations periodically, perhaps once a day, to checkpoint the log file. This can be done either through a \fBcron\fR(1M) job, or manually.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata/root_dir\fR\fR
.ad
.RS 23n
.rt  
On root servers, this file stores the database associated with the root directory. It is similar to other table databases. The corresponding log file is called \fBroot_dir.log\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata/cred.org_dir\fR\fR
.ad
.RS 23n
.rt  
Table containing the credentials of principals in this NIS+ domain.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata/groups_dir\fR\fR
.ad
.RS 23n
.rt  
Table containing the group authorization objects needed by NIS+ to authorize group access.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdata/serving_list\fR\fR
.ad
.RS 23n
.rt  
Contains a list of all NIS+ directories that are being served by the NIS+ server on this server. When this server is added or deleted from any NIS+ directory object, this file is updated by the server.
.RE

.SH SEE ALSO
.sp
.LP
\fBcp\fR(1), \fBcrontab\fR(1), \fBmv\fR(1), \fBnis\fR(1), \fBnis_cachemgr\fR(1M), \fBniscat\fR(1), \fBnismatch\fR(1), \fBnistbladm\fR(1), \fBrm\fR(1), \fBcron\fR(1M), \fBnisclient\fR(1M), \fBnisinit\fR(1M), \fBnislog\fR(1M), \fBnisping\fR(1M), \fBnisprefadm\fR(1M), \fBnisshowcache\fR(1M), \fBnis_objects\fR(3NSL)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating system. Tools to aid the migration from NIS+ to LDAP are available in the current Solaris release. For more information, visit http://www.sun.com/directory/nisplus/transition.html.
