TritonDataCenter/smartos-live/man/man/man4/sysidcfg.4
'\" te
.\" Copyright (C) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with
.\" the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH sysidcfg 4 "23 Jun 2009" "SunOS 5.11" "File Formats"
.SH NAME
sysidcfg \- system identification configuration file
.SH DESCRIPTION
.sp
.LP
When a diskless client boots for the first time or a system installs over the network, the booting software tries to obtain configuration information about the system, such as the system's root password or name service, from, first, a \fBsysidcfg\fR file and then the name service databases. If the booting software cannot find the information, it prompts the user for it. Like the name service databases, the \fBsysidcfg\fR file can be used to avoid the user prompts and provide a totally hands-off booting process.
.sp
.LP
The \fBsysidcfg\fR file preconfigures information through a set of keywords. You can specify one or more of the keywords to preconfigure as much information as you want. Each set of systems (one or more) that has unique configuration information must have its own \fBsysidcfg\fR file. For example, you can use the same \fBsysidcfg\fR file to preconfigure the time zone for multiple systems if you want all the systems to have the same time zone configured. However, if you want to preconfigure a different root password for each of those systems, then each system would need its own \fBsysidcfg\fR file.
.sp
.LP
If a syntax error (such as an invalid keyword) is detected when reading the \fBsysidcfg\fR file, an error message that notes the position in the file where the error was found is sent to the console. Under such a condition, the file is not used.
.SS "Where To Put the \fBsysidcfg\fR File"
.sp
.LP
The \fBsysidcfg\fR file can reside on a shared \fBNFS\fR network directory or the root directory on a \fBUFS\fR or \fBPCFS\fR diskette in the system's diskette drive. If you put the \fBsysidcfg\fR file on a shared \fBNFS\fR network directory, you have to use the \fB-p\fR option of the \fBadd_install_client\fR(1M) command (see \fBinstall_scripts\fR(1M)) to specify where the system being installed can find the \fBsysidcfg\fR file. If you put the \fBsysidcfg\fR file on a diskette, you need to make sure the diskette is in the system's diskette drive when the system boots (on x86 systems, the \fBsysidcfg\fR file should reside on the Solaris Device Configuration Assistant diskette).
.sp
.LP
Only one \fBsysidcfg\fR file can reside in a directory or diskette. If you are creating more than one \fBsysidcfg\fR file, they must reside in different directories or diskettes.
.SS "Keyword Syntax Rules"
.sp
.LP
The following rules apply to the keywords in a \fBsysidcfg\fR file:
.RS +4
.TP
.ie t \(bu
.el o
Keywords can be in any order
.RE
.RS +4
.TP
.ie t \(bu
.el o
Keywords are not case-sensitive
.RE
.RS +4
.TP
.ie t \(bu
.el o
Keyword values can be optionally enclosed in single (\fB\&'\fR) or double (\fB"\fR) quotes
.RE
.RS +4
.TP
.ie t \(bu
.el o
Only the first instance of a keyword is valid; if you specify the same keyword more than once, the first keyword specified is used. The network_interface keyword is exempt from this rule.
.RE
.SS "Keywords - All Platforms"
.sp
.LP
The following keywords apply to both \fBSPARC\fR and x86 platforms.
.SS "Name Service, Domain Name, Name Server"
.sp
.LP
Naming-related keywords are as follows:
.sp
.in +2
.nf
name_service=NIS,NIS+,LDAP,DNS,NONE
.fi
.in -2

.sp
.LP
For the \fBNIS\fR and \fBNIS+\fR keywords, the options are:
.sp
.in +2
.nf
domain_name=\fIdomain_name\fR
name_server=\fIhostname\fR(\fIip_address\fR)
.fi
.in -2

.sp
.LP
The following is an example NIS entry:
.sp
.in +2
.nf
name_service=NIS 
{domain_name=west.arp.com name_server=timber(172.16.2.1)}
.fi
.in -2

.sp
.LP
For NIS+, the example is identical to the one above, except for the replacement of the keyword \fBNIS\fR by \fBNIS+\fR.
.sp
.LP
For DNS, the syntax is:
.sp
.in +2
.nf
domain_name=\fIdomain_name\fR; name_server=\fIip_address\fR, ... ; 
search=\fIdomain_name\fR, ...
.fi
.in -2

.sp
.LP
You can have a maximum of three IP addresses and six domain names. The total length of a \fBsearch\fR entry cannot exceed 250 characters. The following is an example DNS entry:
.sp
.in +2
.nf
name_service=DNS
{domain_name=west.arp.com
name_server=10.0.1.10,10.0.1.20
search=arp.com,east.arp.com}
.fi
.in -2

.sp
.LP
For LDAP, the syntax is:
.sp
.in +2
.nf
domain_name=domain_name;
profile=profile_name;
profile_server=ip_address;
proxy_dn="proxy_bind_dn";
proxy_password=password 
.fi
.in -2

.sp
.LP
The \fBproxy_dn\fR and \fBproxy_password\fR keywords are optional. If \fBproxy_dn\fR is used, the value must be enclosed in double quotes.
.sp
.LP
The following is an example LDAP entry:
.sp
.in +2
.nf
name_service=LDAP
{domain_name=west.arp.com
profile=default
profile_server=172.16.2.1
proxy_dn="cn=proxyagent,ou=profile,dc=west,dc=arp,dc=com"
proxy_password=password}
.fi
.in -2

.sp
.LP
Choose only one value for \fBname_service\fR. Include either, both, or neither of the \fBdomain_name\fR and \fBname_server\fR keywords, as needed. If no keywords are used, omit the curly braces.
.SS "NFS version 4 Default Domain Name"
.sp
.LP
There is only one keyword for specifying the NFSv4 default domain name:
.sp
.in +2
.nf
nfs4_domain=dynamic, \fIvalue\fR
.fi
.in -2

.sp
.LP
where \fIvalue\fR must be a fully qualified domain name, as per RFC1033 and RFC1035 recommendations. The reserved value \fBdynamic\fR suppresses the front-end installation prompt. At the same time, use of \fBdynamic\fR enables the NFSv4 domain to be derived dynamically, at run time, based on naming service configuration.
.sp
.LP
For example:
.sp
.in +2
.nf
nfs4_domain=example.com
.fi
.in -2

.sp
.LP
\&...hard codes the value used by the \fBnfsmapid\fR(1M) daemon to be \fBexample.com\fR. In contrast, the following example shows how to set the \fBnfs4_domain\fR variable to the reserved keyword \fBdynamic\fR:
.sp
.in +2
.nf
nfs4_domain=dynamic
.fi
.in -2

.sp
.LP
The preceding example enables the \fBnfsmapid\fR(1M) daemon to derive the domain from the system's configured naming services, as prescribed in the \fISystem Administration Guide: Network Services\fR.
.SS "Network Interface, Hostname, IP address, Netmask, DHCP, Default Route"
.sp
.LP
Network-related keywords are as follows:
.sp
.in +2
.nf
network_interface=NONE, PRIMARY, \fIvalue\fR
.fi
.in -2

.sp
.LP
where \fIvalue\fR is a name of a network interface, for example, \fBeri0\fR or \fBhme0\fR.
.sp
.LP
For the \fBNONE\fR keyword, the options are:
.sp
.in +2
.nf
hostname=\fIhostname\fR
.fi
.in -2

.sp
.LP
For example,
.sp
.in +2
.nf
network_interface=NONE {hostname=feron}
.fi
.in -2

.sp
.LP
For the \fBPRIMARY\fR and \fIvalue\fR keywords, the options are: 
.sp
.in +2
.nf
primary (used only with multiple network_interface lines)
dhcp
hostname=\fIhostname\fR
ip_address=\fIip_address\fR
netmask=\fInetmask\fR
protocol_ipv6=yes | no
default_route=\fIip_address\fR (IPv4 address only)
.fi
.in -2

.sp
.LP
If you are using the dhcp option, the only other option you can specify is \fBprotocol_ipv6\fR. For example:
.sp
.in +2
.nf
network_interface=PRIMARY {dhcp protocol_ipv6=yes}
.fi
.in -2

.sp
.LP
If you are not using DHCP, you can specify any combination of the other keywords as needed. If you do not use any of the keywords, omit the curly braces. 
.sp
.in +2
.nf
network_interface=eri0 {hostname=feron
	ip_address=172.16.2.7
	netmask=255.255.255.0
	protocol_ipv6=no
	default_route=172.16.2.1}
.fi
.in -2

.SS "Multiple Network Interfaces"
.sp
.LP
If you have multiple network interfaces on your system, you can configure them all in the \fBsysidcfg\fR file by defining multiple \fBnetwork_interface\fR keywords. If you specify multiple \fBnetwork_interface\fR keywords, you cannot use \fBNONE\fR or \fBPRIMARY\fR for values. You must specify interface names for all of the values. To specify the primary interface, use the \fBprimary\fR option value.
.sp
.LP
For example,
.sp
.in +2
.nf
network_interface=eri0 {primary
	hostname=feron
	ip_address=172.16.2.7
	netmask=255.255.255.0
	protocol_ipv6=no
	default_route=172.16.2.1}

network_interface=eri1 {hostname=feron-b
	ip_address=172.16.3.8
	netmask=255.255.255.0
	protocol_ipv6=no
	default_route=172.16.3.1}
.fi
.in -2

.SS "Root Password"
.sp
.LP
The root password keyword is \fBroot_password\fR. Possible values are encrypted from \fB/etc/shadow\fR. Syntax is:
.sp
.in +2
.nf
root_password=\fIencrypted_password\fR
.fi
.in -2

.SS "Security Policy"
.sp
.LP
The security\(emrelated keyword is \fBsecurity_policy\fR. It has the following syntax:
.sp
.in +2
.nf
security_policy=kerberos, NONE
.fi
.in -2

.sp
.LP
The kerberos keyword has the following options:
.sp
.in +2
.nf
{default_realm=\fIFQDN\fR admin_server=\fIFQDN\fR kdc=\fIFQDN\fR1, \fIFQDN\fR2, \fIFQDN\fR3}
.fi
.in -2

.sp
.LP
where \fIFQDN\fR is a fully qualified domain name. An example of the \fBsecurity_policy\fR keyword is as follows:
.sp
.in +2
.nf
security_policy=kerberos {default_realm=Yoursite.COM
admin_server=krbadmin.Yoursite.COM
kdc=kdc1.Yoursite.COM, kdc2.Yoursite.COM}
.fi
.in -2

.sp
.LP
You can list a maximum of three key distribution centers (\fBKDC\fRs) for a \fBsecurity_policy\fR keyword. At least one is required.
.SS "Language in Which to Display the Install Program"
.sp
.LP
The system-location keyword is \fBsystem_locale\fR. It has the following syntax:
.sp
.in +2
.nf
system_locale=\fIlocale\fR
.fi
.in -2

.sp
.LP
where \fIlocale\fR is \fB/usr/lib/locale\fR.
.SS "Terminal Type"
.sp
.LP
The terminal keyword is \fBterminal\fR. It has the following syntax:
.sp
.in +2
.nf
terminal=\fIterminal_type\fR
.fi
.in -2

.sp
.LP
where \fIterminal_type\fR is a value from \fB/usr/share/lib/terminfo/*\fR.
.SS "Timezone Information"
.sp
.LP
The timezone keyword is \fBtimezone\fR. It has the following syntax:
.sp
.in +2
.nf
timezone=\fItimezone\fR
.fi
.in -2

.sp
.LP
where \fItimezone\fR is a value from \fB/usr/share/lib/zoneinfo/*\fRor, where \fItimezone\fR is an offset-from-GMT style quoted timezone. Refer to \fBenviron\fR(5) for information on quoted timezones. An example of a quoted timezone is: t\fBimezone="<GMT+8>+8"\fR.
.SS "Date and Time"
.sp
.LP
The time server keyword is \fBtimeserver\fR. It has the following syntax:
.sp
.in +2
.nf
timeserver=localhost
timeserver=\fIhostname\fR
timeserver=\fIip_address\fR
.fi
.in -2

.sp
.LP
If you specify \fBlocalhost\fR as the time server, the system's time is assumed to be correct. If you specify the hostname or \fIip_address\fR, if you are not running a name service, of a system, that system's time is used to set the time.
.SS "Keyboard Layout"
.sp
.LP
The keyboard keyword is \fBkeyboard\fR. It has the following syntax:
.sp
.in +2
.nf
keyboard=\fIkeyboard_layout\fR
.fi
.in -2

.sp
.LP
The valid \fIkeyboard_layout\fR strings are defined in the \fB/usr/share/lib/keytables/type_6/kbd_layouts\fR file.
.SH EXAMPLES
.LP
\fBExample 1 \fRSample \fBsysidcfg\fR files
.sp
.LP
The following example is a \fBsysidcfg\fR file for a group of \fBSPARC\fR systems to install over the network. The host names, \fBIP\fR addresses, and netmask of these systems have been preconfigured by editing the name service. Because all the system configuration information has been preconfigured, an automated installation can be achieved by using this \fBsysidcfg\fR file in conjunction with a custom JumpStart profile.

.sp
.in +2
.nf
keyboard=US-English
system_locale=en_US
timezone=US/Central
timeserver=localhost
terminal=sun-cmd
name_service=NIS {domain_name=marquee.central.example.com
                  name_server=connor(172.16.112.3)}
root_password=m4QPOWNY
system_locale=C
security_policy=kerberos 
    {default_realm=Yoursite.COM 
     admin_server=krbadmin.Yoursite.COM
     kdc=kdc1.Yoursite.COM, kdc2.Yoursite.COM}
.fi
.in -2

.sp
.LP
The following example is a \fBsysidcfg\fR file created for a group of x86 systems to install over the network that all have the same keyboard, graphics cards, and pointing devices. In this example, users would see only the prompt to select a language, \fIsystem_locale\fR, for displaying the rest of the Solaris installation program.

.sp
.in +2
.nf
keyboard=US-English
display=ati {size=15-inch}
pointer=MS-S
timezone=US/Central
timeserver=connor
terminal=AT386
name_service=NIS {domain_name=marquee.central.example.com
                  name_server=connor(172.16.112.3)}
root_password=URFUni9
security_policy=none
.fi
.in -2

.SH SEE ALSO
.sp
.LP
\fBinstall_scripts\fR(1M), \fBnfsmapid\fR(1M), \fBsysidtool\fR(1M), \fBenviron\fR(5)
.sp
.LP
\fISolaris Express Installation Guide: Basic Installations\fR
