TritonDataCenter/smartos-live/man/man/man4/TrustedExtensionsPolicy.4
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH TrustedExtensionsPolicy 4 "20 Jul 2007" "SunOS 5.11" "File Formats"
.SH NAME
TrustedExtensionsPolicy \- configuration file for Trusted Extensions X Server Extension
.SH SYNOPSIS
.LP
.nf
\fB/usr/X11/lib/X11/xserver/TrustedExtensionsPolicy\fR
.fi

.LP
.nf
\fB/usr/openwin/server/etc/TrustedExtensionsPolicy\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBTrustedExtensionsPolicy\fR is the configuration file for Trusted Extensions X Server Extension (\fBSUN_TSOL\fR). \fBSUN_TSOL\fR provides security policy enforcement. This enforcement is based on Mandatory Access Control (MAC) and Discretionary Access Control (DAC).
.sp
.LP
Blank lines and comments in the \fBTrustedExtensionsPolicy\fR file are ignored. Comments start with a pound sign (#). The format of the file is as follows:
.sp
.in +2
.nf
\fIkeyword\fR{space|tab}\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
where \fIkeyword\fR can be one of the following:
.sp
.ne 2
.mk
.na
\fB\fBatom\fR\fR
.ad
.RS 13n
.rt  
Label this atom \fBADMIN_LOW\fR, so that \fBXGetAtomName\fR(3X11) succeeds.
.RE

.sp
.ne 2
.mk
.na
\fB\fBproperty\fR\fR
.ad
.RS 13n
.rt  
Instantiate this property once. The default is to polyinstantiate a property.
.RE

.sp
.ne 2
.mk
.na
\fB\fBselection\fR\fR
.ad
.RS 13n
.rt  
Polyinstantiate this selection. The default is to instantiate the selection once.
.RE

.sp
.ne 2
.mk
.na
\fB\fBextension\fR\fR
.ad
.RS 13n
.rt  
Disable this extension.
.RE

.sp
.ne 2
.mk
.na
\fB\fBprivilege\fR\fR
.ad
.RS 13n
.rt  
Implicitly allow this window privilege on all clients.
.RE

.sp
.LP
For possible keyword values, see the \fB/usr/X11/lib/X11/xserver/TrustedExtensionsPolicy\fR file for the Xorg X server. For Xsun, see the \fB/usr/openwin/server/etc/TrustedExtensionsPolicy\fR file.
.SH EXAMPLES
.sp
.LP
The following entry in the \fBTrustedExtensionsPolicy\fR file polyinstantiates the \fBDtpad\fR program:
.sp
.in +2
.nf
selection Dtpad
.fi
.in -2
.sp

.sp
.LP
If the entry is missing, or commented out, the \fBDtpad\fR program is instantiated once.
.sp
.LP
Similarly, the following entry instantiates the \fBWM_ICON_SIZE\fR property once:
.sp
.in +2
.nf
property WM_ICON_SIZE
.fi
.in -2
.sp

.sp
.LP
If the entry is missing, or commented out, the \fBWM_ICON_SIZE\fR property is polyinstantiated.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/X11/lib/X11/xserver/TrustedExtensionsPolicy\fR\fR
.ad
.sp .6
.RS 4n
Configuration file for Trusted Extensions X Server Extension
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.03i) |cw(3.47i) 
lw(2.03i) |lw(3.47i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxwts
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBXGetAtomName\fR(3X11), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system is configured with Trusted Extensions.
