TritonDataCenter/smartos-live/man/man/man7d/esp.7d
'\" te
.\"  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH esp 7D "7 Feb 1997" "SunOS 5.11" "Devices"
.SH NAME
esp \- ESP SCSI Host Bus Adapter Driver
.SH SYNOPSIS
.LP
.nf
\fBesp@\fIsbus-slot\fR,80000\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBesp\fR Host Bus Adapter driver is a \fBSCSA\fR compliant nexus driver that supports the Emulex family of esp \fBSCSI\fR chips (esp100, esp100A, esp236, fas101, fas236).
.sp
.LP
The  \fBesp\fR driver supports the standard functions provided by the \fBSCSA\fR interface. The driver supports tagged and untagged queuing, fast \fBSCSI\fR (on FAS esp's only), almost unlimited transfer size (using a moving \fBDVMA\fR window approach),  and auto request sense; but it does not support linked commands.
.SH CONFIGURATION
.sp
.LP
The  \fBesp\fR driver can be configured by defining properties in  \fBesp.conf\fR which override the global \fBSCSI\fR settings. Supported properties are: \fBscsi-options\fR, \fBtarget<\fIn\fR>-scsi-options\fR, \fBscsi-reset-delay\fR, \fBscsi-watchdog-tick\fR, \fBscsi-tag-age-limit\fR, \fBscsi-initiator-id\fR.
.sp
.LP
\fBtarget<\fIn\fR>-scsi-options\fR overrides the  \fBscsi-options\fR property value for \fBtarget<\fIn\fR>\fR. <\fIn\fR> can vary from \fB0\fR to \fB7\fR.
.sp
.LP
Refer to \fBscsi_hba_attach\fR(9F) for details.
.SH EXAMPLES
.LP
\fBExample 1 \fRA sample of esp configuration file.
.sp
.LP
Create a file \fB/kernel/drv/esp.conf\fR and add this line:

.sp
.in +2
.nf
scsi-options=0x78;
.fi
.in -2

.sp
.LP
This will disable tagged queuing, fast \fBSCSI,\fR and Wide mode for all \fBesp\fR instances. To disable an option for one specific  \fBesp\fR (refer to \fBdriver.conf\fR(4)):

.sp
.in +2
.nf
name="esp"
parent="/iommu@f,e0000000/sbus@f,e0001000/espdma@f,400000"
       reg=0xf,0x800000,0x40
       target1-scsi-options=0x58
       scsi-options=0x178 scsi-initiator-id=6;
.fi
.in -2

.sp
.LP
Note that the default initiator ID in OBP is 7 and that the change to ID 6 will occur at attach time. It may be preferable to change the initiator ID in OBP.

.sp
.LP
The above would set  \fBscsi-options\fR for target 1 to  \fB0x58\fR and for all other targets on this \fBSCSI\fR bus to  \fB0x178\fR. The physical pathname of the parent can be determined using the \fB/devices\fR tree or following the link of the logical device name:

.sp
.in +2
.nf
example# \fBls -l /dev/rdsk/c0t3d0s0\fR
lrwxrwxrwx   1 root   root   88 Aug 22 13:29 /dev/rdsk/c0t3d0s0 ->
\&../../devices/iommu@f,e0000000/sbus@f,e0001000/espdma@f,400000/
              esp@f,800000/sd@3,0:a,raw
.fi
.in -2
.sp

.sp
.LP
The register property values can be determined from \fBprtconf\fR(1M) output (\fB-v\fR option):

.sp
.in +2
.nf
	esp, instance #0
	....
       	    Register Specifications:
                Bus Type=0xf, Address=0x800000, Size=40
.fi
.in -2
.sp

.sp
.LP
To set scsi-options more specifically per target:

.sp
.in +2
.nf
target1-scsi-options=0x78;
device-type-scsi-options-list =
        "SEAGATE ST32550W", "seagate-scsi-options" ;
seagate-scsi-options = 0x58;
scsi-options=0x3f8;
.fi
.in -2

.sp
.LP
The above would set \fBscsi-options\fR for target 1 to \fB0x78\fR and for all other targets on this \fBSCSI\fR bus to \fB0x378\fR except for one specific disk type which will have \fBscsi-options\fR set to 0x58.

.sp
.LP
\fBscsi-options\fR specified per target ID has the highest precedence, followed by \fBscsi-options\fR per device type. To get the inquiry string run probe-scsi or probe-scsi-all command at the ok prompt before booting the system.

.sp
.LP
Global, for example. for all esp instances, \fBscsi-options\fR per bus has the lowest precedence.

.sp
.LP
The system needs to be rebooted before the specified \fBscsi-options\fR take effect.

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/esp\fR\fR
.ad
.RS 24n
.rt  
\fBELF\fR Kernel Module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/esp.conf\fR\fR
.ad
.RS 24n
.rt  
Configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSBus-based systems with esp-based
_
SCSI port and SSHA, SBE/S, FSBE/S, 
_
T{
and DSBE/S SBus  SCSI Host Adapter options
T}
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBfas\fR(7D), \fBscsi_abort\fR(9F), \fBscsi_hba_attach\fR(9F), \fBscsi_ifgetcap\fR(9F), \fBscsi_reset\fR(9F), \fBscsi_sync_pkt\fR(9F), \fBscsi_transport\fR(9F), \fBscsi_device\fR(9S), \fBscsi_extended_sense\fR(9S), \fBscsi_inquiry\fR(9S), \fBscsi_pkt\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIOpenBoot Command Reference\fR
.sp
.LP
\fIANSI Small Computer System Interface-2 (SCSI-2)\fR
.sp
.LP
\fIESP Technical Manuals\fR, QLogic Corp.
.SH DIAGNOSTICS
.sp
.LP
The messages described below are some that may appear on the system  console, as well as being logged.
.sp
.LP
The first four messages may be displayed while the  \fBesp\fR driver is trying to attach; these messages mean that the  \fBesp\fR driver was unable to attach. All of these messages are preceded by "esp%d", where "%d" is the instance number of the \fBesp\fR controller.
.sp
.ne 2
.mk
.na
\fB\fBDevice in slave-only slot\fR\fR
.ad
.sp .6
.RS 4n
The SBus device has been placed in a slave-only slot and will not be accessible; move to non-slave-only SBus slot.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDevice is using a hilevel intr\fR\fR
.ad
.sp .6
.RS 4n
The device was configured with an interrupt level that cannot be used with this \fBesp\fR driver. Check the SBus device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUnable to map registers\fR\fR
.ad
.sp .6
.RS 4n
Driver was unable to map device registers; check for bad hardware. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCannot\fR \fBfind\fR \fBdma controller\fR\fR
.ad
.sp .6
.RS 4n
Driver was unable to locate a dma controller. This is an auto-configuration error.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDisabled TQ since disconnects are disabled\fR\fR
.ad
.sp .6
.RS 4n
Tagged queuing was disabled because disconnects were disabled in \fBscsi-options\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBBad clock frequency- setting 20mhz, asynchronous mode\fR\fR
.ad
.sp .6
.RS 4n
Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSync pkt failed\fR\fR
.ad
.sp .6
.RS 4n
Syncing a \fBSCSI\fR packet failed. Refer to \fBscsi_sync_pkt\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fBSlot %x: All tags in use!!!\fR\fR
.ad
.sp .6
.RS 4n
The driver could not allocate another tag number. The target devices do not properly support tagged queuing.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTarget %d.%d cannot alloc tag queue\en\fR\fR
.ad
.sp .6
.RS 4n
The driver could not allocate space for tag queue.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGross\fR \fBerror\fR \fBin esp status (%x)\fR\fR
.ad
.sp .6
.RS 4n
The driver experienced severe \fBSCSI\fR bus problems. Check cables and terminator.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSpurious interrupt\fR\fR
.ad
.sp .6
.RS 4n
The driver received an interrupt while the hardware was not interrupting.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLost state in phasemanage\fR\fR
.ad
.sp .6
.RS 4n
The driver is confused about the state of the \fBSCSI\fR bus.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUnrecoverable DMA\fR \fBerror\fR \fBduring selection\fR\fR
.ad
.sp .6
.RS 4n
The DMA controller experienced host SBus problems. Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fB\fBBad sequence step (0x%x) in selection\fR\fR
.ad
.sp .6
.RS 4n
The esp hardware reported a bad sequence step. Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUndetermined selection failure\fR\fR
.ad
.sp .6
.RS 4n
The selection of a target failed unexpectedly. Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>2 reselection IDs\fR \fBon\fR \fBthe bus\fR\fR
.ad
.sp .6
.RS 4n
Two targets selected simultaneously, which is illegal. Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fB\fBReconnect: unexpected bus free\fR\fR
.ad
.sp .6
.RS 4n
A reconnect by a target failed. Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTimeout\fR \fBon\fR \fBreceiving tag msg\fR\fR
.ad
.sp .6
.RS 4n
Suspect target f/w failure in tagged queue handling.
.RE

.sp
.ne 2
.mk
.na
\fB\fBParity\fR \fBerror\fR \fBin tag msg\fR\fR
.ad
.sp .6
.RS 4n
A parity error was detected in a tag message. Suspect \fBSCSI\fR bus problems.
.RE

.sp
.ne 2
.mk
.na
\fB\fBBotched tag\fR\fR
.ad
.sp .6
.RS 4n
The target supplied bad tag messages. Suspect target f/w failure in tagged queue handling.
.RE

.sp
.ne 2
.mk
.na
\fB\fBParity\fR \fBerror\fR \fBin reconnect msg's\fR\fR
.ad
.sp .6
.RS 4n
The reconnect failed because of parity errors.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTarget <n> didn't disconnect after sending <message>\fR\fR
.ad
.sp .6
.RS 4n
The target unexpectedly did not disconnect after sending <message>.
.RE

.sp
.ne 2
.mk
.na
\fB\fBNo support\fR \fBfor\fR \fBmultiple segs\fR\fR
.ad
.sp .6
.RS 4n
The \fBesp\fR driver can only transfer contiguous data.
.RE

.sp
.ne 2
.mk
.na
\fB\fBNo dma window?\fR\fR
.ad
.sp .6
.RS 4n
Moving the \fBDVMA\fR window failed unexpectedly.
.RE

.sp
.ne 2
.mk
.na
\fB\fBNo dma window\fR \fBon\fR \fB<type> operation\fR\fR
.ad
.sp .6
.RS 4n
Moving the \fBDVMA\fR window failed unexpectedly.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCannot\fR \fBset\fR \fBnew dma window\fR\fR
.ad
.sp .6
.RS 4n
Moving the \fBDVMA\fR window failed unexpectedly.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUnable to set new window at <address> for <type> operation\fR\fR
.ad
.sp .6
.RS 4n
Moving the \fBDVMA\fR window failed unexpectedly.
.RE

.sp
.ne 2
.mk
.na
\fB\fBIllegal dma boundary? %x\fR\fR
.ad
.sp .6
.RS 4n
An attempt was made to cross a boundary that the driver could not handle.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUnwanted data out/in\fR \fBfor\fR \fBTarget <n>\fR\fR
.ad
.sp .6
.RS 4n
The target went into an unexpected phase.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSpurious <name> phase from target <n>\fR\fR
.ad
.sp .6
.RS 4n
The target went into an unexpected phase.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSCSI bus DATA IN phase parity error\fR\fR
.ad
.sp .6
.RS 4n
The driver detected parity errors on the \fBSCSI\fR bus.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSCSI bus MESSAGE IN phase parity error\fR\fR
.ad
.sp .6
.RS 4n
The driver detected parity errors on the \fBSCSI\fR bus.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSCSI bus STATUS phase parity\fR \fBerror\fR\fR
.ad
.sp .6
.RS 4n
The driver detected parity errors on the \fBSCSI\fR bus.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPremature end of extended message\fR\fR
.ad
.sp .6
.RS 4n
An extended \fBSCSI\fR bus message did not complete. Suspect a target f/w problem.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPremature end of input message\fR\fR
.ad
.sp .6
.RS 4n
A multibyte input message was truncated. Suspect a target f/w problem.
.RE

.sp
.ne 2
.mk
.na
\fB\fBInput message botch\fR\fR
.ad
.sp .6
.RS 4n
The driver is confused about messages coming from the target.
.RE

.sp
.ne 2
.mk
.na
\fB\fBExtended message <n> is too long\fR\fR
.ad
.sp .6
.RS 4n
The extended message sent by the target is longer than expected.
.RE

.sp
.ne 2
.mk
.na
\fB\fB<name> message <n> from Target <m> garbled\fR\fR
.ad
.sp .6
.RS 4n
Target <m> sent message <name> of value <n> which the driver did not understand.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTarget <n> rejects our message <name>\fR\fR
.ad
.sp .6
.RS 4n
Target <n> rejected a message sent by the driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fBRejecting message <name> from Target <n>\fR\fR
.ad
.sp .6
.RS 4n
The driver rejected a message received from target <n>
.RE

.sp
.ne 2
.mk
.na
\fB\fBCmd dma\fR \fBerror\fR\fR
.ad
.sp .6
.RS 4n
The driver was unable to send out command bytes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTarget <n> refused message resend\fR\fR
.ad
.sp .6
.RS 4n
The target did not accept a message resend.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTwo-byte message <name> <value> rejected\fR\fR
.ad
.sp .6
.RS 4n
The driver does not accept this two-byte message.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUnexpected selection attempt\fR\fR
.ad
.sp .6
.RS 4n
An attempt was made to select this host adapter by another initiator.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPolled cmd failed (target busy)\fR\fR
.ad
.sp .6
.RS 4n
A polled command failed because the target did not complete outstanding commands within a reasonable time.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPolled cmd failed\fR\fR
.ad
.sp .6
.RS 4n
A polled command failed because of timeouts or bus errors.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDisconnected\fR command \fBtimeout\fR for \fBTarget <id>.<lun>\fR\fR
.ad
.sp .6
.RS 4n
A timeout occurred while target/lun was disconnected. This is usually a target f/w problem. For tagged queuing targets, <n> commands were outstanding when the timeout was detected.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDisconnected tagged cmds (<n>) timeout for Target <id>.<lun>\fR\fR
.ad
.sp .6
.RS 4n
A timeout occurred while target/lun was disconnected. This is usually a target f/w problem. For tagged queuing targets, <n> commands were outstanding when the timeout was detected.
.RE

.sp
.ne 2
.mk
.na
\fB\fBConnected command timeout for Target <id>.<lun>\fR \fR
.ad
.sp .6
.RS 4n
This is usually a \fBSCSI\fR bus problem. Check cables and termination.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTarget <id>.<lun> reverting to async. mode\fR\fR
.ad
.sp .6
.RS 4n
A data transfer hang was detected. The driver attempts to eliminate  this problem by reducing the data transfer rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTarget <id>.<lun> reducing sync. transfer rate\fR\fR
.ad
.sp .6
.RS 4n
A data transfer hang was detected. The driver attempts to eliminate  this problem by reducing the data transfer rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBReverting to slow SCSI cable mode\fR\fR
.ad
.sp .6
.RS 4n
A data transfer hang was detected. The driver attempts to eliminate  this problem by reducing the data transfer rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBReset SCSI bus failed\fR\fR
.ad
.sp .6
.RS 4n
An attempt to reset the \fBSCSI\fR bus failed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBExternal SCSI bus reset\fR\fR
.ad
.sp .6
.RS 4n
Another initiator reset the \fBSCSI\fR bus.
.RE

.SH WARNINGS
.sp
.LP
The  \fBesp\fR hardware does not support Wide \fBSCSI\fR mode. Only FAS-type esp's support fast \fBSCSI\fR (10 MB/sec).
.SH NOTES
.sp
.LP
The \fBesp\fR driver exports properties indicating per target the negotiated transfer speed (\fBtarget<n>-sync-speed\fR) and whether tagged queuing has been enabled (\fBtarget<n>-TQ\fR). The \fBsync-speed\fR property value is the data transfer rate in KB/sec. The \fBtarget-TQ\fR property has no value. The existence of the property indicates that tagged queuing has been enabled. Refer to \fBprtconf\fR(1M) (verbose option) for viewing the \fBesp\fR properties. 
.sp
.in +2
.nf
         dma, instance #3
             Register Specifications:
                 Bus Type=0x2, Address=0x81000, Size=10
             esp, instance #3
                  Driver software properties:
                      name <target3-TQ> length <0> \(mi <no
value>.
                      name <target3-sync-speed> length <4>
                          value <0x00002710>.
                      name <scsi-options> length <4>
                          value <0x000003f8>.
                      name <scsi-watchdog-tick> length <4>
                          value <0x0000000a>.
                      name <scsi-tag-age-limit> length <4>
                          value <0x00000008>.
                      name <scsi-reset-delay> length <4>
                          value <0x00000bb8>.
.fi
.in -2

