TritonDataCenter/smartos-live/man/man/man7d/ibdma.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ibdma 7D "21 May 2009" "SunOS 5.11" "Devices"
.SH NAME
ibdma \- Solaris InfiniBand Device Manager Agent
.SH DESCRIPTION
.sp
.LP
The Infiniband Device Manager Agent (\fBibdma\fR) is an IBTF-compliant kernel misc module. 
.sp
.LP
\fBIBDMA\fR implements limited portions of the target (agent) side of the InfiniBand Device Management class as described in \fIInfiniBand Architecture Specification, Volume 1: Release 1.2.1\fR. 
.sp
.LP
\fBIBDMA\fR responds to incoming Device Management Datagrams (MADS) by enumerating available target-side Infiniband services. Initiator systems can use this service to discover target-side resources such as the virtual I/O Controllers exported by \fBsrpt\fR(7D).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/ibdma\fR\fR
.ad
.RS 30n
.rt  
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/ibdma\fR\fR
.ad
.RS 30n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/ibdma\fR\fR
.ad
.RS 30n
.rt  
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWibdmar
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBib\fR(7D), \fBibdm\fR(7D), \fBibtl\fR(7D), \fBsrpt\fR(7D)
.sp
.LP
\fIInfiniBand Architecture Specification, Volume 1: Release 1.2.1\fR
