TritonDataCenter/smartos-live/man/man/man7d/pcmem.7d
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH pcmem 7D "20 Mar 1995" "SunOS 5.11" "Devices"
.SH NAME
pcmem \- PCMCIA memory card nexus driver
.SH DESCRIPTION
.sp
.LP
The \fBpcmem\fR driver identifies the type of memory card in the system and will allow future support of other memory device types.
.sp
.LP
The  \fBPCMCIA\fR memory card nexus driver supports  \fBPCMCIA\fR memory card client drivers. There are no user-configurable options for this driver.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/pcmem\fR\fR
.ad
.RS 21n
.rt  
\fBpcmem\fR driver
.RE

.SH SEE ALSO
.sp
.LP
\fBpcram\fR(7D)
