TritonDataCenter/smartos-live/man/man/man7d/tpf.7d
'\" te
.\"  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved 
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH tpf 7D "1 Jan 1997" "SunOS 5.11" "Devices"
.SH NAME
tpf \- Platform Specific Module (PSM) for Tricord Systems Enterprise Server Models ES3000, ES4000 and ES5000.
.SH DESCRIPTION
.sp
.LP
\fBtpf\fR provides the platform dependent functions for Solaris x86 MP support. These functions adhere to the PSMI Specifications.  (Platform Specific Module Interface Specifications.) Tricord Systems Enterprise Servers are Intel APIC based MP platforms  which run from 1 to 12 Intel processors. The  \fBtpf\fR psm supports dynamic interrupt distribution across all processors in an MP  configuration.
.sp
.LP
The psm is automatically invoked on an ESxxxx platform at system boot time.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/mach/tpf\fR\fR
.ad
.RS 20n
.rt  
MP module.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
