TritonDataCenter/smartos-live/man/man/man1m/aliasadm.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH aliasadm 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
aliasadm \- manipulate the NIS+ aliases map
.SH SYNOPSIS
.LP
.nf
\fBaliasadm\fR \fB-a\fR \fIalias\fR \fIexpansion\fR [\fIoptions comments\fR] \fIoptional flags\fR
.fi

.LP
.nf
\fBaliasadm\fR \fB-c\fR \fIalias\fR \fIexpansion\fR [\fIoptions\fR \fIcomments\fR] 
     [\fIoptional\fR \fIflags\fR]
.fi

.LP
.nf
\fBaliasadm\fR \fB-d\fR \fIalias\fR [\fIoptional\fR \fIflags\fR]
.fi

.LP
.nf
\fBaliasadm\fR \fB-e\fR \fIalias\fR [\fIoptional\fR \fIflags\fR]
.fi

.LP
.nf
\fBaliasadm\fR \fB-l\fR \fIalias\fR [\fIoptional\fR \fIflags\fR]
.fi

.LP
.nf
\fBaliasadm\fR \fB-m\fR \fIalias\fR [\fIoptional\fR \fIflags\fR]
.fi

.LP
.nf
\fBaliasadm\fR [\fB-I\fR] [\fB-D\fR \fIdomainname\fR] [\fB-f\fR \fIfilename\fR] [\fB-M\fR \fImapname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBaliasadm\fR makes changes to the alias map.
.sp
.LP
The alias map is an NIS+ table object with four columns:
.sp
.ne 2
.mk
.na
\fB\fBalias\fR\fR
.ad
.RS 13n
.rt  
The name of the alias as a null terminated string.
.RE

.sp
.ne 2
.mk
.na
\fB\fIexpansion\fR\fR
.ad
.RS 13n
.rt  
The value of the alias as it would appear in a \fBsendmail\fR \fB/etc/aliases\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB\fIoptions\fR\fR
.ad
.RS 13n
.rt  
A list of options applicable to this alias. The only option currently supported is \fBCANON\fR. With this option, if the user has requested an inverse alias lookup, and there is more than one alias with this expansion, this alias is given preference.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcomments\fR\fR
.ad
.RS 13n
.rt  
An arbitrary string containing comments about this alias. The \fBsendmail\fR(1M) command reads this map in addition to the NIS aliases map and the local \fB/etc/aliases\fR database.
.RE

.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 17n
.rt  
Add an alias.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 17n
.rt  
Change an alias.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 17n
.rt  
Delete an alias.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 17n
.rt  
Edit the alias map.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR\fR
.ad
.RS 17n
.rt  
Initialize the NIS+ aliases database.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 17n
.rt  
List the alias map.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 17n
.rt  
Print or match an alias.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fIdomainname\fR\fR
.ad
.RS 17n
.rt  
Edit the map in domain \fBdomainname\fR instead of the current domain.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 17n
.rt  
When editing or listing the database, use \fIfilename\fR instead of invoking the editor.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR \fImapname\fR\fR
.ad
.RS 17n
.rt  
Edit \fImapname\fR instead of \fImail_aliases\fR.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/aliases\fR\fR
.ad
.RS 16n
.rt  
mail aliases for the local host in ASCII format
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
\fBsendmail\fR(1M), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating system. Tools to aid the migration from NIS+ to LDAP are available in the current Solaris release. For more information, visit http://www.sun.com/directory/nisplus/transition.html.
