TritonDataCenter/smartos-live/man/man/man1m/dfshares.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH dfshares 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
dfshares \- list available resources from remote or local systems
.SH SYNOPSIS
.LP
.nf
\fBdfshares\fR [\fB-F\fR \fIFSType\fR] [\fB-h\fR] [\fB-o\fR \fIspecific_options\fR] [\fIserver\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBdfshares\fR provides information about resources available to the host through a distributed file system of type \fIFSType\fR. \fIspecific_options\fR as well as the semantics of \fIserver\fR are specific to particular distributed file systems.
.sp
.LP
If \fBdfshares\fR is entered without arguments, all resources  currently shared on the local system are displayed, regardless  of file system type.
.sp
.LP
The output of \fBdfshares\fR consists of an optional header line (suppressed with the \fB-h\fR flag) followed by a list of lines containing whitespace-separated fields.  For each resource, the fields are:
.sp
.in +2
.nf
\fIresource server access transport\fR
.fi
.in -2

.sp
.LP
where
.sp
.ne 2
.mk
.na
\fB\fIresource\fR\fR
.ad
.RS 13n
.rt  
Specifies the resource name that must be given to the \fBmount\fR(1M) command.
.RE

.sp
.ne 2
.mk
.na
\fB\fIserver\fR\fR
.ad
.RS 13n
.rt  
Specifies the name of the system that is making the resource available.
.RE

.sp
.ne 2
.mk
.na
\fB\fIaccess\fR\fR
.ad
.RS 13n
.rt  
Specifies the access permissions granted to the client systems, either \fBro\fR (for read-only) or \fBrw\fR (for read/write). If \fBdfshares\fR cannot determine access permissions, a hyphen  (\fB\(mi\fR) is displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fItransport\fR\fR
.ad
.RS 13n
.rt  
Specifies the transport provider over which the resource is shared.
.RE

.sp
.LP
A field may be null. Each null field is indicated by a hyphen (\(mi) unless the remainder of the fields on the line are also null; in which case, the hyphen may be omitted.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIFSType\fR\fR
.ad
.RS 23n
.rt  
Specify filesystem type.  Defaults to the first entry in \fB/etc/dfs/fstypes\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 23n
.rt  
Suppress header line in output.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIspecific_options\fR\fR
.ad
.RS 23n
.rt  
Specify options specific to the filesystem provided by the \fB-F\fR option.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/fstypes\fR\fR
.ad
.RS 20n
.rt  

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBdfmounts\fR(1M), \fBmount\fR(1M), \fBshare\fR(1M), \fBunshare\fR(1M), \fBattributes\fR(5)
