TritonDataCenter/smartos-live/man/man/man1m/imqbrokerd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH imqbrokerd 1M "11 Mar 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
imqbrokerd \- start a Message Queue broker instance
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/imqbrokerd\fR [\fIoption\fR\&.\|.\|.]
.fi

.LP
.nf
\fB/usr/bin/imqbrokerd\fR \fB-h\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBimqbrokerd\fR starts an instance of the Message Queue broker. The Message Queue broker is the main component of a Message Queue message server. The broker performs reliable delivery of messages to and from Java Message Service (\fBJMS\fR) clients. 
.sp
.LP
\fBimqbrokerd\fR uses command line options to specify broker configuration properties.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-backup\fR \fIfileName\fR\fR
.ad
.sp .6
.RS 4n
Back up a Master Broker's configuration change record to \fIfileName\fR. This option only applies to broker clusters. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-cluster\fR \fIbrokerList\fR\fR
.ad
.sp .6
.RS 4n
Specify the list of broker instances which are connected in a cluster. This list is merged with the list in the imq.cluster.brokerlist property. This option only applies to broker clusters. 
.sp
\fIbrokerList\fR is a comma-separated list of broker instances, each specified by \fIhostName\fR:\fIport\fR (the host on which the broker instance is running and the port number it is using) If you don't specify a value for \fIhostName\fR, \fBlocalhost\fR is used. If you don't specify a value for \fIport\fR, the value of \fB7676\fR is used. For example: \fBhost1:8899,host2,:7878\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-dbpassword\fR \fIpassword\fR\fR
.ad
.sp .6
.RS 4n
Specify the password for a plugged-in JDBC-compliant database used as a Message Queue data store. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-dbuser\fR \fIuserName\fR\fR
.ad
.sp .6
.RS 4n
Specify the user name for a plugged-in JDBC-compliant data store. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fIDproperty\fR\fB-=\fR\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Set the specified broker configuration property to the \fIvalue\fR. The system does not validate either the configuration property or \fIvalue\fR. Therefore, spelling, formatting, and case is important. Message Queue can not set incorrect values passed using the \fB-D\fR option. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-force\fR\fR
.ad
.sp .6
.RS 4n
Perform action without user confirmation. This option only applies when you use the \fB-remove\fR \fIinstance\fR option, which normally requires confirmation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
Display usage help. Execute nothing else on the command line.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-javahome\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
Specify the path to an alternate Java 2-compatible Java Development Kit (JDK) or Java Runtime Environment (JRE) The default is to use the runtime bundled with the operating system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-ldappassword\fR \fIpassword\fR\fR
.ad
.sp .6
.RS 4n
Specify the password for accessing an LDAP user repository when using an LDAP server (as opposed to a built-in flat-file repository) to authenticate users of a Message Queue message server. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-license\fR [\fIname\fR]\fR
.ad
.sp .6
.RS 4n
Specify the license to load, if different from the default for your Message Queue product edition. If you don't specify a license name, this lists all licenses installed on the system. Depending on the installed Message Queue edition, the values for \fIname\fR are \fBpe\fR (Platform Edition-basic features), \fBtry\fR (Platform Edition-90-day trial enterprise features), and \fBunl\fR (Enterprise Edition). 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-loglevel\fR \fIlevel\fR\fR
.ad
.sp .6
.RS 4n
Specify the logging level. Valid values for \fIlevel\fR are \fBNONE\fR, \fBERROR\fR, \fBWARNING\fR, or \fBINFO\fR. The default value is \fBINFO\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-metrics\fR \fIint\fR\fR
.ad
.sp .6
.RS 4n
Report metrics at a specific interval. Specify \fIint\fR as the number of seconds.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-name\fR \fIbrokerName\fR\fR
.ad
.sp .6
.RS 4n
Specify the instance name of this broker and use the corresponding instance configuration file. If you do not specify a broker name, the name of the file is set to \fBimqbroker\fR. If you run more than one instance of a broker on the same host, each must have a unique name. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-passfile\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
Specify the name of the file from which to read the passwords for the SSL keystore, LDAP user repository, or JDBC-compliant database. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-password\fR \fIkeypassword\fR\fR
.ad
.sp .6
.RS 4n
Specify the password for the SSL certificate keystore. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-port\fR \fInumber\fR\fR
.ad
.sp .6
.RS 4n
Specify the broker's Port Mapper port number. By default, this is set to \fB7676\fR. To run two instances of a broker on the same server, each broker's Port Mapper must have a different port number. JMS clients connect to the broker instance using this port number.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-remove\fR \fIinstance\fR\fR
.ad
.sp .6
.RS 4n
Remove the broker instance. Delete the instance configuration file, log files, data store, and other files and directories associated with the broker instance. This option requires user confirmation unless you also specify the \fB-force\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-reset\fR store|messages|durables|props\fR
.ad
.sp .6
.RS 4n
Reset the data store (or a subset of the store) or resets the configuration properties of the broker instance when the broker instance is started. The action depends on the argument provided. 
.sp
.ne 2
.mk
.na
\fBstore\fR
.ad
.RS 12n
.rt  
Clear all persistent data in the data store, including messages, durable subscriptions, and transaction information store.
.RE

.sp
.ne 2
.mk
.na
\fBmessages\fR
.ad
.RS 12n
.rt  
Clear all persistent messages durable.
.RE

.sp
.ne 2
.mk
.na
\fBdurables\fR
.ad
.RS 12n
.rt  
Clear all durable subscriptions.
.RE

.sp
.ne 2
.mk
.na
\fBprops\fR
.ad
.RS 12n
.rt  
Clear all configuration information in the \fBconfig.props\fR instance configuration file. All properties assume default values.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-restore\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
Replace the Master Broker's configuration change record with the specified backup file. This file must have been previously created using the \fB-backup\fR option. This option only applies to broker clusters. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-shared\fR \fR
.ad
.sp .6
.RS 4n
Specify that the jms connection service be implemented using the shared threadpool model, in which threads are shared among connections to increase the number of connections supported by a broker instance. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-silent\fR \fR
.ad
.sp .6
.RS 4n
Turn off logging to the console. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-tty\fR \fI\fR\fR
.ad
.sp .6
.RS 4n
Display all messages be to the console. \fBWARNING\fR and \fBERROR\fR level messages are displayed on the console by default.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-upgrade-store-nobackup\fR\fR
.ad
.sp .6
.RS 4n
Specify that an earlier, incompatible version Message Queue data store is automatically removed when migrating to Message Queue 3.5 format. 
.sp
If you do not use this option, you must manually delete the earlier data store. This applies to both built-in (flat-file) persistence and plugged-in (JDBC-compliant) persistence. Migration of the earlier data store to a Message Queue 3.5 data store takes place the first time you start a Message Queue 3.5 broker instance on an earlier version data store.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-version\fR \fI\fR\fR
.ad
.sp .6
.RS 4n
Display the version number of the installed product. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-vmargs\fR \fIare\fR [[\fIarg\fR]\&.\|.\|.]\fR
.ad
.sp .6
.RS 4n
 Specify arguments to pass to the Java VM. Separate arguments with spaces. If you want to pass more than one argument or if an argument contains a space, use enclosing quotation marks. For example:
.sp
.in +2
.nf
imqbrokerd \fB-tty\fR \fB-vmargs\fR " \fB-Xmx128m\fR \fB-Xincgc\fR"
.fi
.in -2
.sp

.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
 The following environment variables affect the execution of this command: 
.sp
.ne 2
.mk
.na
\fB\fBIMQ_JAVAHOME\fR\fR
.ad
.RS 16n
.rt  
Specify the Java 2 compatible runtime. When this environment variable is not set it defaults to \fB/usr/j2se\fR. 
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/init.d/imq \fR \fR
.ad
.sp .6
.RS 4n
Shell script for starting \fBimqbrokerd\fR. This file looks at the \fB/etc/imq/imqbrokerd.conf\fR file. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/imq/imqbrokerd.conf\fR\fR
.ad
.sp .6
.RS 4n
Configuration file which controls the behavior of the broker startup script.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/imq/passwd\fR\fR
.ad
.sp .6
.RS 4n
 Flat file user repository for authenticating users.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/imq/accesscontrol.properties\fR\fR
.ad
.sp .6
.RS 4n
 Controls client access to broker functionality.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/imq/passfile.sample\fR\fR
.ad
.sp .6
.RS 4n
Sample passfile used by the \fB-passfile\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/imq/instances/brokerName/props/config.properties \fR\fR
.ad
.sp .6
.RS 4n
Broker instance configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiqu
.TE

.SH SEE ALSO
.sp
.LP
\fBimqadmin\fR(1M), \fBimqcmd\fR(1M), \fBimqdbmgr\fR(1M), \fBimqkeytool\fR(1M), \fBimqobjmgr\fR(1M), \fBimqusermgr\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fISun Java System Message Queue Administrator's Guide\fR
