TritonDataCenter/smartos-live/man/man/man1m/iscsitgtd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with
.\" the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH iscsitgtd 1M "16 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
iscsitgtd \- iSCSI Target daemon
.SH SYNOPSIS
.LP
.nf
\fBiscsitgtd\fR [\fB-d\fR \fIdoor_file\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBiscsitgtd\fR daemon process implements the iSCSI configuration,  control, and data paths, providing iSCSI Target Mode support in the Solaris operating system.
.sp
.LP
The configuration and control path is by means of the Solaris Doors  subsystem (see \fBdoor_create\fR(3C)), and provides the interface between the  iSCSI Target administration utility, \fBiscsitadm\fR(1M), persistence configuration data stored in the Service Configuration Facility (SCF) of the service  management facility (SMF). See \fBsmf\fR(5).
.sp
.LP
The data path managed by the daemon exists between TPC/IP port 3260, and the files, block devices, or raw SCSI devices configured as iSCSI target LUNs.
.SH OPTIONS
.sp
.LP
The following options is supported: 
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdoor_file\fR\fR
.ad
.sp .6
.RS 4n
Override the location of the Solaris Door used for configuration from \fB/var/run/iscsi_tgt_door\fR to a door of one's choosing.
.RE

.SS "Solaris Configuration Facility (SCF)"
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fBPGR-basedir\fR\fR
.ad
.sp .6
.RS 4n
SCSI-3 PGR base directory for ZVOL failover. Set to \fB/\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdaemonize\fR\fR
.ad
.sp .6
.RS 4n
Run as Solaris daemon process. Either \fBtrue\fR or \fBfalse\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdbg-lvl\fR\fR
.ad
.sp .6
.RS 4n
Runtime debug level to console.
.RE

.sp
.ne 2
.mk
.na
\fB\fBqlog-lvl\fR\fR
.ad
.sp .6
.RS 4n
Runtime logging to \fB/tmp/target_log\fR.
.RE

.sp
.LP
The following are the logging values, in hexadecimal.
.sp
.in +2
.nf
0x00001 - Connection errors
0x00002 - Connection login errors
0x00004 - Connection Non-I/O errors
0x00008 - Connection I/O errors
0x00010 - Session errors
0x00020 - Session login errors
0x00040 - Session Non-I/O errors
0x00080 - Session I/O errors
0x00100 - Emulation errors
0x00200 - Emulation Non-I/O errors
0x00400 - Emulation I/O errors
0x01000 - General errors
0x02000 - General details
0x04000 - iSNS details
0x10000 - SCSI-3 PGR errors
0x20000 - SCSI-3 PGR Non-I/O errors
0x40000 - SCSI-3 PGR I/O errors
.fi
.in -2
.sp

.SH EXAMPLES
.LP
\fBExample 1 \fRListing All \fBiscsitgt\fR Values
.sp
.LP
The following commands lists all \fBiscsitgt\fR values.

.sp
.in +2
.nf
# \fBsvccfg -s iscsitgt listprop iscsitgt\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRSetting SCF Options
.sp
.LP
The following command sets the \fBPGR-basedir\fR option.

.sp
.in +2
.nf
# \fBsvccfg -s iscsitgt setprop iscsitgt/PGR-basedir = astring: "/"\fR
.fi
.in -2
.sp

.sp
.LP
The following command sets the \fBdbg-lvl\fR option.

.sp
.in +2
.nf
# \fBsvccfg -s iscsitgt setprop iscsitgt/dbg-lvl = integer: 0x80ffffff\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiscsitgtu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBiscsitadm\fR(1M), \fBdoor_create\fR(3C), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The iSCSI Target daemon, \fBiscsitgtd\fR, is managed by the service management facility, \fBsmf\fR(5), under the fault management resource identifier:
.sp
.in +2
.nf
svc:/system/iscsitgt:default
.fi
.in -2
.sp

