TritonDataCenter/smartos-live/man/man/man1m/kcfd.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH kcfd 1M "30 Sep 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
kcfd \- kernel-level cryptographic framework daemon
.SH SYNOPSIS
.LP
.nf
\fBkcfd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBkcfd\fR daemon helps in managing CPU usage by cryptographic operations performed in software by kernel threads. The system utilization associated with these threads is charged to the \fBkcfd\fR process. It also does module verification for kernel cryptographic modules.
.sp
.LP
Only a privileged user can run this daemon.
.sp
.LP
The \fBkcfd\fR daemon is automatically invoked in run level 1, after \fB/usr\fR is mounted. A previously invoked \fBkcfd\fR daemon that is still running must be stopped before invoking another \fBkcfd\fR command.
.sp
.LP
Manually starting and restarting \fBkcfd\fR is not recommended. If it is necessary to do so, use the \fBcryptoadm\fR(1M) \fBstart\fR and \fBstop\fR subcommands.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 8n
.rt  
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB> 1\fR \fR
.ad
.RS 8n
.rt  
Daemon failed to start.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsl/SUNWcslx
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBcryptoadm\fR(1M), \fBattributes\fR(5)
