TritonDataCenter/smartos-live/man/man/man1m/ldap_cachemgr.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ldap_cachemgr 1M "7 Oct 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
ldap_cachemgr \- LDAP daemon to manage client configuration for LDAP based Network Information Service lookups
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ldap/ldap_cachemgr\fR [\fB-l\fR \fIlog-file\fR] [\fB-g\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBldap_cachemgr\fR daemon is a process that provides an up-to-date configuration cache for LDAP naming services. It is started during multi-user boot.
.sp
.LP
The \fBldap_cachemgr\fR utility provides caching for all parameters as specified and used by the LDAP naming service clients. The \fBldap_cachemgr\fR utility uses the cache files which are originally created by executing the \fBldapclient\fR(1M) utility, as cold start files. Updates to the cache files take place dynamically if profiles are used to configure the client. See the \fBinit\fR option to \fBldapclient\fR(1M).
.sp
.LP
The \fBldap_cachemgr\fR utility helps improve the performance of the clients that are using LDAP as the Naming service repository. In order for the LDAP naming services to function properly, the \fBldap_cachemgr\fR daemon must be running. \fBldap_cachemgr\fR also improves system security by making the configuration files readable by superuser only.
.sp
.LP
The cache maintained by this daemon is shared by all the processes that access LDAP Naming information. All processes access this cache through a door call. On startup, \fBldap_cachemgr\fR initializes the cache from the cache files. See \fBldapclient\fR(1M). Thus, the cache survives machine reboots.
.sp
.LP
The \fBldap_cachemgr\fR daemon also acts as its own administration tool. If an instance of \fBldap_cachemgr\fR is already running, commands are passed transparently to the running version.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
Print current configuration and statistics to standard output. This is the only option executable without superuser privileges.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlog-file\fR\fR
.ad
.sp .6
.RS 4n
Cause \fBldap_cachemgr\fR to use a log file other than the default \fB/var/ldap/cachemgr.log\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRStopping and Restarting the \fBldap_cachemgr\fR Daemon
.sp
.LP
The following example shows how to stop and to restart the \fBldap_cachemgr\fR daemon.

.sp
.in +2
.nf
example# svcadm disable network/ldap/client
example# svcadm enable network/ldap/client
.fi
.in -2
.sp

.LP
\fBExample 2 \fRForcing \fBldap_cachemgr\fR to Reread Configuration Files
.sp
.LP
The following example shows how to force \fBldap_cachemgr\fR to reread the \fB/var/ldap/ldap_client_file\fR and \fB/var/ldap/ldap_client_cred\fR files

.sp
.in +2
.nf
example# pkill -HUP ldap_cachemgr
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/ldap/cachemgr.log\fR\fR
.ad
.sp .6
.RS 4n
Default log file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/ldap/ldap_client_file\fR\fR
.ad
.br
.na
\fB\fB/var/ldap/ldap_client_cred\fR\fR
.ad
.sp .6
.RS 4n
Files containing the LDAP configuration of the client. These files are not to be modified manually. Their content is not guaranteed to be human readable. Use \fBldapclient\fR(1M) to update these files.
.RE

.SH WARNINGS
.sp
.LP
The \fBldap_cachemgr\fR utility is included in the current Solaris release on an uncommitted basis only. It is subject to change or removal in a future minor release.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
\fBldap\fR(1), \fBldapadd\fR(1), \fBldapdelete\fR(1), \fBldaplist\fR(1), \fBldapmodify\fR(1), \fBldapmodrdn\fR(1), \fBldapsearch\fR(1), \fBpkill\fR(1), \fBsvcs\fR(1), \fBidsconfig\fR(1M), \fBldapaddent\fR(1M), \fBldapclient\fR(1M), \fBsuninstall\fR(1M), \fBsvcadm\fR(1M), \fBsignal.h\fR(3HEAD), \fBresolv.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBldap_cachemgr\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/ldap/client
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
