TritonDataCenter/smartos-live/man/man/man1m/localectr.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH localectr 1M "7 Sep 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
localectr \- customize and build new locales
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/localectr\fR
.fi

.LP
.nf
\fB/usr/bin/localectr\fR \fB-l\fR \fIlocale1\fR,\fIlocale2\fR... [\fB-d\fR \fIdestination_path\fR]
     [\fB-c\fR \fIcompiler_path\fR] [\fB-r\fR 0 | 1 | 2] [\fB-i\fR \fIpkginfo_template\fR]
     [\fB-p\fR \fIpkgname_prefix\fR]
.fi

.LP
.nf
\fB/usr/bin/localectr\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/bin/localectr\fR \fB-q\fR
.fi

.LP
.nf
\fB/usr/bin/localectr\fR \fB-V\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBlocalectr\fR utility allows new locales to be customized and built. The output of \fBlocalectr\fR is an installable package containing the compiled shared object binary which contains the locale data information as well as a number of other supporting files that are required to have a fully working locale on the system.
.sp
.LP
Once generated, the package can be added to the system by using the \fBpkgadd\fR(1M) command and removed with \fBpkgrm\fR(1M).
.sp
.LP
Depending on your default system login, you might have to reset your user environment after you add a locale. If \fBdtlogin(1X)\fR (for the CDE user environment) is the default system login, you need to restart \fBdtlogin\fR. No action is required if \fBgdm(1)\fR (for the Gnome user environment) is the default login.
.sp
.LP
There are two interfaces to \fBlocalectr\fR, command line (CLI) and graphical user interface (GUI). To customize the locale data, you must use the GUI. To create locales with standard locale data according to Unicode's Common Locale Data Repository (CLDR), the CLI is sufficient.
.sp
.LP
With the CLI it is also possible to generate several locales in a single step, with a separate package being generated for each locale. With the GUI, a single locale is processed at a time.
.sp
.LP
To launch the GUI, run the \fBlocalectr\fR command with no options. To run from the CLI, use the appropriate options as described below.
.sp
.LP
\fBlocalectr\fR uses the \fBlocaledef\fR(1) utility to build the locale data binary shared object. Therefore, access to a C compiler is required in order to run \fBlocalectr\fR successfully, as this is also required by \fBlocaledef\fR.
.sp
.LP
\fBlocalectr\fR is mainly concerned with locale data. However, in order to create a fully working locale on the system with \fBlocalectr\fR, many features, such as fonts, translations and input methods, are also required. Depending on what locales are already installed on the system, the relevant features might or might not be present on the system. If they are not present, then \fBlocaleadm\fR(1M) should be used to add the relevant packages before adding packages created by \fBlocalectr\fR. \fBlocalectr\fR bundles locale data for the latest set of locales available in Unicode's CLDR. A user can also create a locale not available in CLDR by supplying her own data in the \fBlocalectr\fR GUI.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcompiler_path\fR\fR
.ad
.sp .6
.RS 4n
Specify the path to the C compiler that is used to compile the locale data into a shared object binary. Not required if the compiler is already in the user's \fBPATH\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdestination_path\fR\fR
.ad
.sp .6
.RS 4n
Specify the path to the directory where the created package is to be stored.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
Displays the usage message.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fItemplate_file\fR\fR
.ad
.sp .6
.RS 4n
The full path to user defined \fBpkginfo\fR(4) template file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlocale1,locale2...\fR\fR
.ad
.sp .6
.RS 4n
Specify a comma-separated  list of locale(s) to generate. Locale names are in the form: \fIlocale\fR.\fIcodeset\fR@\fIvariant\fR, where \fIcodeset\fR and \fIvariant\fR are optional. The default and only allowed \fIcodeset\fR is \fBUTF-8\fR. The default \fIvariant\fR is \fBlocalectr\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
The package name prefix
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.sp .6
.RS 4n
Queries \fBlocalectr\fR for a complete list of locales for which locale data is defined in \fBlocalectr\fR. When \fBlocalectr\fR is run from the CLI, the locale(s) specified with the \fB-l\fR option must be on this list in order for an installable locale package to be generated.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
Specify the range of Unicode characters for which locale data rules in the \fBLC_CTYPE\fR and \fBLC_COLLATE\fR categories are to be generated. There are three valid options:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Locale data rules are restricted to the exemplar or to commonly used characters of the locale in question.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
Locale data  rules are restricted to the Unicode plane 0 characters, whose codepoints fall in the range \fBu0000\fR-\fBuFFFF\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
Locale data rules are generated for all codepoints defined in the latest version of Unicode that is supported by the system on which \fBlocalectr\fR is being run.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
Shows the version of this software.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRLaunching the GUI
.sp
.LP
The following example launches the \fBlocalectr\fR GUI.

.sp
.in +2
.nf
example% \fBlocalectr\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRGenerating Locale for Afrikaans (South Africa) with Default Locale Data
.sp
.LP
The following example generates a package in the specified destination directory, which can be used to install the Afrikaans (\fBaf_ZA.UTF-8\fR) locale on the system. The package name is composed of a prefix followed by the hyphen separated ISO-639 language code, the ISO-3166 country code, the locale encoding and an optional user-defined tag. The resulting package can then be added to the system using \fBpkgadd\fR(1M). 

.sp
.in +2
.nf
example% \fBlocalectr -l af_ZA -d /tmp\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRGenerating Several South Africa Locales with Full Unicode Range of Characters
.sp
.LP
The following example generates an installable package for each of the specified locales.

.sp
.in +2
.nf
 example% \fBlocalectr -l af_ZA,en_ZA,xh_ZA,zu_ZA -d /tmp -r 2\fR
.fi
.in -2
.sp

.LP
\fBExample 4 \fRGenerating the Irish Locale with a User-Specified Tag
.sp
.LP
The following example will generate a locale whose full name is \fBga_IE.UTF-8@mycompanyname\fR.

.sp
.in +2
.nf
example% \fBlocalectr -l ga_IE@mycompanyname -d /tmp\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit codes are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/bin/localectr\fR\fR
.ad
.sp .6
.RS 4n
Wrapper script that launches locale creator.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/localectr\fR\fR
.ad
.sp .6
.RS 4n
Jar files, scripts, and locale data repository needed to run the application.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWlocalecreator
_
Interface StabilitySee below.
.TE

.sp
.LP
Interface stability is Committed for command-line options and is Uncommitted for other interfaces.
.SH SEE ALSO
.sp
.LP
\fBlocale\fR(1), \fBlocaledef\fR(1), \fBlocaleadm\fR(1M), \fBpkgadd\fR(1M), \fBpkgrm\fR(1M), \fBpkginfo\fR(4), \fBattributes\fR(5)
.sp
.LP
\fBdtlogin\fR(1X), \fBgdm\fR(1)(these are not SunOS man pages)
.sp
.LP
\fIInternational Language Environments Guide\fR
