TritonDataCenter/smartos-live/man/man/man1m/nisaddcred.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH nisaddcred 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisaddcred \- create NIS+ credentials
.SH SYNOPSIS
.LP
.nf
\fBnisaddcred\fR [\fB-p\fR \fIprincipal\fR] [\fB-P\fR \fInis_principal\fR] 
     [\fB-l\fR \fIlogin_password\fR] \fIauth_type\fR [\fIdomain_name\fR]
.fi

.LP
.nf
\fBnisaddcred\fR \fB-r\fR [\fInis_principal\fR] [\fIdomain_name\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnisaddcred\fR command is used to create security credentials for NIS+ principals. NIS+ credentials serve two purposes. The first is to provide authentication information to various services; the second is to map the authentication service name into a NIS+ principal name.
.sp
.LP
When the \fBnisaddcred\fR command is run, these credentials get created and stored in a table named \fBcred.org_dir\fR in the default NIS+ domain. If \fIdomain_name\fR is specified, the entries are stored in the \fBcred.org_dir\fR of the specified domain. The specified domain must either be the one to which you belong, or one in which you are authenticated and authorized to create credentials, that is, a subdomain. Note that the credentials of normal users must be stored in the same domain as their passwords.
.sp
.LP
It is simpler to add credentials using \fBnisclient\fR(1M), because it obtains the required information itself. \fBnispopulate\fR(1M) is used for "bulk" updates and can also be used to add credentials for entries in the \fBhosts\fR and the \fBpasswd\fR NIS+ tables.
.sp
.LP
NIS+ principal names are used in specifying clients that have access rights to NIS+ objects. For more details, refer to the "Principal Names" subsection of the \fBNIS+\fR(1) manual page. See \fBnischmod\fR(1), \fBnischown\fR(1), \fB nis_objects\fR(3NSL), and \fBnis_groups\fR(3NSL). Various other services can also implement access control based on these principal names.
.sp
.LP
The \fBcred.org_dir\fR table is organized as follows:
.sp

.sp
.TS
tab();
lw(1.06i) lw(.93i) lw(1.32i) lw(1.06i) lw(1.14i) 
lw(1.06i) lw(.93i) lw(1.32i) lw(1.06i) lw(1.14i) 
.
\fBcname\fR\fBauth_type\fR\fBauth_name\fR\fBpublic_data\fR\fBprivate_data\fR
_
user1.foo.com.LOCAL299010,102,44
_
user1.foo.com.DESunix.2990@foo.com098...8193b8...ab2
_
user1.foo.com.DHmmm-nunix.2990@foo.com248...428a42...f32
.TE

.sp
.LP
The \fBcname\fR column contains a canonical representation of the NIS+ principal name. By convention, this name is the login name of a user, or the host name of a machine, followed by a dot ('.') followed by the fully qualified "home" domain of that principal. For users, the home domain is defined to be the domain where their \fBDES\fR credentials are kept. For hosts, their home domain is defined to be the domain name returned by the \fBdomainname\fR(1M) command executed on that host.
.sp
.LP
There are two basic types of \fIauth_type\fR entries in the \fBcred.org_dir\fR table, those with authentication type \fBLOCAL,\fR and those with authentication type \fBDES,\fR \fIauth_type\fR, specified on the command line in upper or lower case, should be either \fIlocal\fR or \fBdes\fR.
.sp
.LP
However, the \fBcred.org_dir\fR table may also be used to hold data for other values of \fIauth_type\fR. Currently, this is limited to the mechanisms listed on the \fBnisauthconf\fR(1M) man page, for which the \fBnisaddcred\fR \fIauth_type\fR argument is the same as the name of the mechanism. These mechanisms use a modified form of Secure RPC, and they are similar to the \fBDES\fR authentication type.
.sp
.LP
If the \fIauth_type\fR is \fBdes\fR, and other authentication mechanisms are configured with \fBnisauthconf\fR(1M), then credential entries are added or updated for each mechanism configured. To only add or update 1992-bit Diffie Hellman credentials, that is, those with the \fIauth_type\fR of \fBDES,\fR use dh192-0 on the command line. If there are no authentication mechanisms configured, using \fBdes\fR on the command line will only add or update 192-bit Diffie Hellman credentials.
.sp
.LP
Entries of type \fBLOCAL\fR are used by the \fBNIS+\fR service to determine the correspondence between fully qualified \fBNIS+\fR principal names and users identified by \fBUIDs\fR in the domain containing the \fBcred.org_dir\fR table. This correspondence is required when associating requests made using the \fBAUTH_SYS\fR RPC authentication flavor (see \fBrpc_clnt_auth\fR(3NSL)) to a NIS+ principal name. It is also required for mapping a \fB UID\fR in one domain to its fully qualified NIS+ principal name whose home domain may be elsewhere. The principal's credentials for any authentication flavor may then be sought for within the \fBcred.org_dir\fR table in the principal's home domain (extracted from the principal name). The same \fBNIS+\fR principal may have \fBLOCAL\fR credential entries in more than one domain. Only users, and not machines, have \fBLOCAL\fR credentials. In their home domain, users of \fBNIS+\fR should have both types of credentials.
.sp
.LP
The \fIauth_name\fR associated with the \fBLOCAL\fR type entry is a \fBUID\fR that is valid for the principal in the domain containing the \fBcred.org_dir\fR table. This may differ from that in the principal's home domain. The public information stored in \fIpublic_data\fR for this type contains a list of \fBGIDs\fR for groups in which the user is a member. The \fBGIDs\fR also apply to the domain in which the table resides. There is no private data associated with this type. Neither a \fBUID\fR nor a principal name should appear more than once among the \fBLOCAL\fR entries in any one \fBcred.org_dir\fR table.
.sp
.LP
The \fBDES\fR \fIauth_type\fR is used for Secure RPC authentication (see \fBsecure_rpc\fR(3NSL)).
.sp
.LP
The authentication name associated with the \fBDES\fR \fIauth_type\fR is a Secure RPC \fInetname\fR. A Secure RPC netname has the form \fBunix.\fR\fBid\fR\fB@\fR\fIdomain.com,\fR where \fIdomain\fR must be the same as the domain of the principal. For principals that are users the \fBid\fR must be the \fBUID\fR of the principal in the principal's home domain. For principals that are hosts, the \fBid\fR is the host's name. In Secure RPC, processes running under effective \fBUID\fR 0 (root) are identified with the host principal. Unlike \fBLOCAL\fR, there cannot be more than one \fBDES\fR credential entry for one NIS+ principal in the NIS+ namespace.
.sp
.LP
The public information in an entry of authentication type \fBDES\fR is the public key for the principal. The private information in this entry is the private key of the principal encrypted by the principal's network password.
.sp
.LP
User clients of NIS+ should have credentials of both types in their home domain. In addition, a principal must have a \fBLOCAL\fR entry in the \fBcred.org_dir\fR table of each domain from which the principal wishes to make authenticated requests. A client of NIS+ that makes a request from a domain in which it does not have a \fBLOCAL\fR entry will be unable to acquire \fBDES\fR credentials. A NIS+ service running at security level 2 or higher will consider such users unauthenticated and assign them the name \fInobody\fR for determining access rights.
.sp
.LP
This command can only be run by those NIS+ principals who are authorized to add or delete the entries in the \fBcred\fR table.
.sp
.LP
If credentials are being added for the caller itself, \fBnisaddcred\fR automatically performs a keylogin for the caller.
.sp
.LP
You can list the \fBcred\fR entries for a particular principal with \fBnismatch\fR(1).
.sp
.LP
The \fBcred.org_dir\fR \fBNIS+\fR table replaces the maps \fIpublickey.byname\fR and \fInetid.byname\fR used in \fBNIS (YP).\fR
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprincipal\fR\fR
.ad
.RS 22n
.rt  
The name \fIprincipal\fR specifies the name of the principal as defined by the naming rules for that specific mechanism. For example, \fBLOCAL\fR credential names are supplied with this option by including a string specifying a \fBUID.\fR For \fBDES\fR credentials, the name should be a Secure RPC netname of the form \fBunix.\fR\fBid\fR\fB@\fR\fIdomain.com,\fR as described earlier. If the \fB-p\fR option is not specified, the \fIauth_name\fR field is constructed from the effective UID of the current process and the name of the local domain.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fInis_principal\fR\fR
.ad
.RS 22n
.rt  
Use the \fBNIS+\fR principal name \fInis_principal\fR. This option should be used when creating \fBLOCAL\fR or \fBDES\fR credentials for users whose home domain is different than the local machine's default domain.
.sp
Whenever the \fB-P\fR option is not specified, \fBnisaddcred\fR constructs a principal name for the entry as follows. When it is not creating an entry of type \fBLOCAL,\fR \fBnisaddcred\fR calls \fBnis_local_principal\fR, which looks for an existing \fBLOCAL\fR entry for the effective \fBUID\fR of the current process in the \fBcred.org_dir\fR table and uses the associated principal name for the new entry. When creating an entry of authentication type \fBLOCAL\fR, \fBnisaddcred\fR constructs a default NIS+ principal name by taking the login name of the effective \fBUID\fR for its own process, and appending to it a dot ('.') followed by the local machine's default domain. If the caller is a superuser, the machine name is used instead of the login name.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlogin_password\fR\fR
.ad
.RS 22n
.rt  
Use the \fIlogin_password\fR specified as the password to encrypt the secret key for the credential entry. This overrides the prompting for a password from the shell. This option is intended for administration scripts only. Prompting guarantees not only that no one can see your password on the command line using \fBps\fR(1) but it also checks to make sure you have not made any mistakes. \fIlogin_password\fR does not really have to be the user's password but if it is, it simplifies logging in.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR [\fInis_principal\fR]\fR
.ad
.RS 22n
.rt  
Remove all credentials associated with the principal \fInis_principal\fR from the \fBcred.org_dir\fR table. This option can be used when removing a client or user from the system. If \fInis_principal\fR is not specified the default is to remove credentials for the current \fIuser\fR. If \fIdomain_name\fR is not specified, the operation is executed in the default NIS+ domain.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRAdding the \fBLOCAL\fR and \fBDES\fR Credentials
.sp
.LP
The following examples illustrate how to add the \fBLOCAL\fR and \fBDES\fR credentials for some user, \fBuser1\fR, with a \fBUID\fR of \fB2990\fR, who is an \fBNIS+\fR user principal in the \fBsome.domain.com.\fR NIS+ domain:

.sp
.in +2
.nf
example% \fBnisaddcred -p 2990 -P user1.some.domain.com. local\fR
.fi
.in -2
.sp

.sp
.LP
Note that credentials are always added in the \fBcred.org_dir\fR table in the domain where \fBnisaddcred\fR is run, unless \fIdomain_name\fR is specified as the last parameter on the command line. If credentials are being added from the domain server for its clients, then \fIdomain_name\fR should be specified. The caller should have adequate permissions to create entries in the \fBcred.org_dir\fR table.

.sp
.LP
The system administrator can add a \fBDES\fR credential for the same user, using the following example:

.sp
.in +2
.nf
example% \fBnisaddcred -p unix.2990@some.domain.com -P user1.some.domain.com. des\fR
.fi
.in -2
.sp

.sp
.LP
Please note that \fBDES\fR credentials can be added only after the \fBLOCAL\fR credentials have been added. Also, if the system is configured to use more than one authentication mechanism, credentials will be made for each mechanism configured. See \fBnisauthconf\fR(1M).

.sp
.LP
Note that the secure RPC netname does not end with a dot ('.') while the NIS+ principal name, specified with the \fB-P\fR option, does. This command should be executed from a machine in the same domain as is the user.

.sp
.LP
The following example shows how to add a machine's \fBDES\fR credentials in the same domain:

.sp
.in +2
.nf
example% nisaddcred -p unix.foo@some.domain.com -P foo.some.domain.com. des
.fi
.in -2
.sp

.sp
.LP
Please note that no \fBLOCAL\fR credentials are needed in this case.

.sp
.LP
The following example illustrates how to add a \fBNIS+\fR workstation's principal \fBDES\fR credential:

.sp
.in +2
.nf
example% \fBnisaddcred -p unix.host1@sub.some.domain.com \e
     -P newhost.sub.some.domain.com. des sub.some.domain.com.\fR
.fi
.in -2
.sp

.sp
.LP
This format is particularly useful if you are running this command from a server which is in a higher domain than sub.some.domain.com. Without the last option for domain name, \fBnisaddcred\fR would fail because it would attempt to use the default domain of some.domain.com.

.sp
.LP
The following example illustrates adding \fBDES\fR credentials without being prompted for the root login password:

.sp
.in +2
.nf
example% \fBnisaddcred -p unix.2990@some.domain.com \e
     -P user1.some.domain.com. -l login_password des\fR
.fi
.in -2
.sp

.sp
.LP
The following example shows how to add a credential for a user using a specific authentication mechanism that was previously configured with \fBnisauthconf\fR(1M). See \fBnisauthconf\fR(1M) for a list of the valid values of \fIauth_type\fR:

.sp
.in +2
.nf
example% \fBnisaddcred -p unix.2990@some.domain.com \e
     -P user.1.some.domain.com dh640-0\fR
.fi
.in -2
.sp

.sp
.LP
The password should be the same for all the credentials that belong to the user. Otherwise, only the credentials encrypted with the user's password will be used at login, and the user will have to run \fBchkey\fR(1) using the \fB-p\fR option.

.sp
.LP
The following example shows how to add a \fBDES\fR credential when other authentication mechanisms are configured on the system:

.sp
.in +2
.nf
example% \fBnisaddcred -p unix.2990@some.domain.com \e
     -P user1.some.domain.com dh192-0\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
Operation failed.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
\fBchkey\fR(1), \fBkeylogin\fR(1), \fBNIS+\fR(1), \fBnischmod\fR(1), \fBnischown\fR(1), \fBnismatch\fR(1), \fBnistbladm\fR(1), \fBps\fR(1), \fBdomainname\fR(1M), \fBnisclient\fR(1M), \fBnispopulate\fR(1M), \fBnis_groups\fR(3NSL), \fBnis_local_names\fR(3NSL), \fBnis_objects\fR(3NSL), \fBrpc_clnt_auth\fR(3NSL), \fBsecure_rpc\fR(3NSL), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating system. Tools to aid the migration from NIS+ to LDAP are available in the current Solaris release. For more information, visit http://www.sun.com/directory/nisplus/transition.html.
