TritonDataCenter/smartos-live/man/man/man1m/nisclient.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH nisclient 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisclient \- initialize NIS+ credentials for NIS+ principals
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisclient\fR \fB-c\fR [\fB-x\fR] [\fB-o\fR] [\fB-v\fR] 
     [\fB-l\fR \fI<network_password>\fR] [\fB-d\fR \fI<NIS+_domain>\fR] \fIclient_name\fR...
.fi

.LP
.nf
\fB/usr/lib/nis/nisclient\fR \fB-i\fR [\fB-x\fR] [\fB-v\fR] \fB-h\fR \fI<NIS+_server_host>\fR 
     [\fB-a\fR \fI<NIS+_server_addr>\fR] 
     [\fB-k\fR \fI<key_domain>\fR] [\fB-d\fR \fI<NIS+_domain>\fR] [\fB-S\fR \fI0\fR | \fI2\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisclient\fR \fB-u\fR [\fB-x\fR] [\fB-v\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisclient\fR \fB-r\fR [\fB-x\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The nisclient shell script can be used to:
.RS +4
.TP
.ie t \(bu
.el o
create NIS+ credentials for hosts and users
.RE
.RS +4
.TP
.ie t \(bu
.el o
initialize NIS+ hosts and users
.RE
.RS +4
.TP
.ie t \(bu
.el o
restore the network service environment
.RE
.sp
.LP
NIS+ credentials are used to provide authentication information of NIS+ clients to NIS+ service.
.sp
.LP
Use the first synopsis (\fB-c\fR option) to create individual NIS+ credentials for hosts or users. You must be logged in as a NIS+ principal in the domain for which you are creating the new credentials. You must also have write permission to the local "cred" table. The \fIclient_name\fR argument accepts any valid host or user name in the NIS+ domain (for example, the \fIclient_name\fR must exist in the hosts or passwd table). \fBnisclient\fR verifies each \fIclient_name\fR against both the \fBhost\fR and \fBpasswd\fR tables, then adds the proper NIS+ credentials for hosts or users. Note that if you are creating NIS+ credentials outside of your local domain, the host or user must exist in the \fBhost\fR or \fBpasswd\fR tables in both the local and remote domains.
.sp
.LP
By default, \fBnisclient\fR will not overwrite existing entries in the credential table for the hosts and users specified. To overwrite, use the \fB-o\fR option. After the credentials have been created, \fBnisclient\fR will print the command that must be executed on the client machine to initialize the host or the user. The \fB-c\fR option requires a network password for the client which is used to encrypt the secret key for the client. You can either specify it on the command line with the \fB-l\fR option or the script will prompt you for it. You can change this network password later with \fBpasswd\fR(1) or \fBchkey\fR(1).
.sp
.LP
\fBnisclient \fR\fB-c\fR is not intended to be used to create NIS+ credentials for all users and hosts which are defined in the passwd and hosts tables. To define credentials for all users and hosts, use \fBnispopulate\fR(1M).
.sp
.LP
Use the second synopsis (\fB-i\fR option) to initialize a NIS+ client machine. The \fB-i\fR option can be used to convert machines to use NIS+ or to change the machine's domainname. You must be logged in as super-user on the machine that is to become a NIS+ client. Your administrator must have already created the NIS+ credential for this host by using \fBnisclient\fR \fB-c\fR or \fBnispopulate \fR\fB-C\fR. You will need the network password your administrator created. \fBnisclient\fR will prompt you for the network password to decrypt your secret key and then for this machine's root login password to generate a new set of secret/public keys. If the NIS+ credential was created by your administrator using \fBnisclient\fR \fB-c\fR, then you can simply use the initialization command that was printed by the \fBnisclient\fR script to initialize this host instead of typing it manually.
.sp
.LP
To initialize an unauthenticated NIS+ client machine, use the \fB-i\fR option with \fB-S\fR \fI0\fR. With these options, the \fBnisclient\fR \fB-i\fR option will not ask for any passwords.
.sp
.LP
During the client initialization process, files that are being modified are backed up as \fIfiles\fR\fB\&.no_nisplus\fR. The files that are usually modified during a client initialization are: \fB/etc/defaultdomain\fR, \fB/etc/nsswitch.conf\fR, \fB/etc/inet/hosts\fR, and, if it exists, \fB/var/nis/NIS_COLD_START\fR. Notice that a file will not be saved if a backup file already exists.
.sp
.LP
The \fB-i\fR option does not set up a NIS+ client to resolve hostnames using \fBDNS\fR. Please refer to the \fBDNS\fR documentation for information on setting up \fBDNS\fR. (See \fBresolv.conf\fR(4)).
.sp
.LP
It is not necessary to initialize either NIS+ root master servers or machines that were installed as NIS+ clients using \fBsuninstall\fR(1M).
.sp
.LP
Use the third synopsis (\fB-u\fR option) to initialize a NIS+ user. You must be logged in as the user on a NIS+ client machine in the domain where your NIS+ credentials have been created. Your administrator should have already created the NIS+ credential for your username using \fBnisclient\fR \fB-c\fR or \fBnispopulate\fR(1M). You will need the network password your administrator used to create the NIS+ credential for your username. \fBnisclient\fR will prompt you for this network password to decrypt your secret key and then for your login password to generate a new set of secret/public keys.
.sp
.LP
Use the fourth synopsis (\fB-r\fR option) to restore the network service environment to whatever you were using before \fBnisclient\fR \fB-i\fR was executed. You must be logged in as super-user on the machine that is to be restored. The restore will only work if the machine was initialized with \fBnisclient\fR \fB-i\fR because it uses the backup files created by the \fB-i\fR option.
.sp
.LP
Reboot the machine after initializing a machine or restoring the network service.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR <\fINIS+_server_addr\fR>\fR
.ad
.RS 25n
.rt  
Specifies the \fBIP \fRaddress for the NIS+ server. This option is used \fIonly\fR with the \fB-i\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 25n
.rt  
Adds \fBDES\fR credentials for NIS+ principals.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR <\fINIS+_domain\fR>\fR
.ad
.RS 25n
.rt  
Specifies the NIS+ domain where the credential should be created when used in conjunction with the \fB-c\fR option. It specifies the name for the new NIS+ domain when used in conjunction with the \fB-i\fR option. The default is your current domainname.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR <\fINIS+_server_host\fR>\fR
.ad
.RS 25n
.rt  
Specifies the NIS+ server's hostname. This option is used \fIonly\fR with the \fB-i\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 25n
.rt  
Initializes a NIS+ client machine.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR <\fInetwork_password\fR>\fR
.ad
.RS 25n
.rt  
Specifies the network password for the clients. This option is used \fIonly\fR with the \fB-c\fR option. If this option is not specified, the script will prompt you for the network password.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fI<key_domain>\fR\fR
.ad
.RS 25n
.rt  
This option specifies the domain where root's credentials are stored. If a domain is not specified, then the system default domain is assumed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 25n
.rt  
Overwrites existing credential entries. The default is not to overwrite. This is used \fIonly\fR with the \fB-c\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 25n
.rt  
Restores the network service environment.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fI0|2\fR\fR
.ad
.RS 25n
.rt  
Specifies the authentication level for the NIS+ client. Level \fB0\fR is for unauthenticated clients and level \fB2\fR is for authenticated (\fBDES\fR) clients. The default is to set up with level \fB2\fR authentication. This is used \fIonly\fR with the \fB-i\fR option. \fBnisclient\fR always uses level \fB2\fR authentication (\fBDES\fR) for both \fB-c\fR and \fB-u\fR options. There is no need to run \fBnisclient\fR with \fB-u\fR and \fB-c\fR for level \fB0\fR authentication. To configure authentication mechanisms other than \fBDES\fR at security level 2, use \fBnisauthconf\fR(1M) before running \fBnisclient\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 25n
.rt  
Initializes a NIS+ user.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 25n
.rt  
Runs the script in verbose mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 25n
.rt  
Turns the "echo" mode on. The script just prints the commands that it would have executed. Notice that the commands are not actually executed. The default is off.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRAdding the DES Credential in the Local Domain
.sp
.LP
To add the \fBDES\fR credential for host \fBsunws\fR and user \fBfred\fR in the local domain:

.sp
.in +2
.nf
example% \fB/usr/lib/nis/nisclient -c sunws fred\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRAdding the DES Credential in a Specified Domain
.sp
.LP
To add the \fBDES\fR credential for host \fBsunws\fR and user \fBfred\fR in domain \fBxyz.example.com.\fR:

.sp
.in +2
.nf
example% \fB/usr/lib/nis/nisclient -c -d xyz.example.com. sunws fred\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRInitializing the Host in a Specific Domain
.sp
.LP
To initialize host \fBsunws\fR as a NIS+ client in domain \fBxyz.example.com.\fR where \fBnisplus_server\fR is a server for the domain \fBxyz.example.com.\fR:

.sp
.in +2
.nf
example# \fB/usr/lib/nis/nisclient -i -h nisplus_server -d xyz.example.com\fR
.fi
.in -2
.sp

.sp
.LP
The script will prompt you for the \fBIP\fR address of \fBnisplus_server\fR if the server is not found in the \fB/etc/hosts\fR file. The \fB-d\fR option is needed only if your current domain name is different from the new domain name.

.LP
\fBExample 4 \fRInitializing the Host as an Unauthenticated Client in a Specific Domain
.sp
.LP
To initialize host \fBsunws\fR as an unauthenticated NIS+ client in domain \fBxyz.example.com.\fR where \fBnisplus_server\fR is a server for the domain \fBxyz.example.com\fR:

.sp
.in +2
.nf
example# \fB/usr/lib/nis/nisclient -i -S 0 \e 
   -h nisplus_server -d xyz.example.com. -a 172.16.44.1\fR
.fi
.in -2
.sp

.LP
\fBExample 5 \fRInitializing the User as a NIS+ principal
.sp
.LP
To initialize user \fBfred\fR as a NIS+ principal, log in as user \fBfred\fR on a NIS+ client machine.

.sp
.in +2
.nf
example% \fB/usr/lib/nis/nisclient -u\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/nis/NIS_COLD_START\fR\fR
.ad
.RS 27n
.rt  
This file contains a list of servers, their transport addresses, and their Secure RPC public keys that serve the machines default domain.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/defaultdomain\fR\fR
.ad
.RS 27n
.rt  
The system default domainname.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 27n
.rt  
Configuration file for the name-service switch.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/hosts\fR\fR
.ad
.RS 27n
.rt  
Local host name database.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
\fBchkey\fR(1), \fBkeylogin\fR(1), \fBNIS+\fR(1), \fBpasswd\fR(1), \fBkeyserv\fR(1M), \fBnisaddcred\fR(1M), \fBnisauthconf\fR(1M), \fBnisinit\fR(1M), \fBnispopulate\fR(1M), \fBsuninstall\fR(1M), \fBnsswitch.conf\fR(4), \fBresolv.conf\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating system. Tools to aid the migration from NIS+ to LDAP are available in the current Solaris release. For more information, visit http://www.sun.com/directory/nisplus/transition.html.
