TritonDataCenter/smartos-live/man/man/man1m/nissetup.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH nissetup 1M "13 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nissetup \- initialize a NIS+ domain
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nissetup\fR [\fB-Y\fR] [\fIdomain\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBnissetup\fR is a shell script that sets up a NIS+ domain to service clients that wish to store system administration information in a domain named \fIdomain\fR. This domain should already exist prior to executing this command. See \fBnismkdir\fR(1) and \fBnisinit\fR(1M).
.sp
.LP
A NIS+ domain consists of a NIS+ directory and its subdirectories: \fBorg_dir\fR and \fBgroups_dir\fR. \fBorg_dir\fR stores system administration information and \fBgroups_dir\fR stores information for group access control.
.sp
.LP
\fBnissetup\fR creates the subdirectories \fBorg_dir\fR and \fBgroups_dir\fR in \fIdomain\fR. Both subdirectories will be replicated on the same servers as the parent domain. After the subdirectories are created, \fBnissetup\fR creates the default tables that NIS+ serves. These are \fBauto_master\fR, \fBauto_home\fR, \fBbootparams\fR, \fBcred\fR, \fBethers\fR, \fBgroup\fR, \fBhosts\fR, \fBmail_aliases\fR, \fBnetmasks\fR, \fBnetworks\fR, \fBpasswd\fR, \fBprotocols\fR, \fBrpc\fR, \fBservices\fR, and \fBtimezone\fR. The \fBnissetup\fR script uses the \fBnistbladm\fR(1) command to create these tables. The script can be easily customized to add site specific tables that are created at setup time.
.sp
.LP
This command is normally executed just once per domain.
.sp
.LP
While this command creates the default tables, it does not initialize them with data. This is accomplished with the \fBnisaddent\fR(1M) command.
.sp
.LP
It is easier to use the \fBnisserver\fR(1M) script to create subdirectories and the default tables.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-Y\fR\fR
.ad
.RS 6n
.rt  
Specify that the domain will be served as both a NIS+ domain as well as an NIS domain using the backward compatibility flag. This will set up the domain to be less secure by making all the system tables readable by unauthenticated clients as well.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
\fBNIS+\fR(1), \fBnismkdir\fR(1), \fBnistbladm\fR(1), \fBnisaddent\fR(1M), \fBnisinit\fR(1M) \fBnisserver\fR(1M), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating system. Tools to aid the migration from NIS+ to LDAP are available in the current Solaris release. For more information, visit http://www.sun.com/directory/nisplus/transition.html.
