TritonDataCenter/smartos-live/man/man/man1m/nisshowcache.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH nisshowcache 1M "13 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisshowcache \- NIS+ utility to print out the contents of the shared cache file
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisshowcache\fR [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBnisshowcache\fR prints out the contents of the per-machine NIS+ directory cache that is shared by all processes accessing NIS+ on the machine. By default, \fBnisshowcache\fR only prints out the directory names in the cache along with the list of active servers. The shared cache is maintained by \fBnis_cachemgr\fR(1M).
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
Verbose mode. Print out the contents of each directory object, including the information on the server name and its universal addresses.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/nis/NIS_SHARED_DIRCACHE\fR\fR
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBnis_cachemgr\fR(1M), \fBsyslogd\fR(1M), \fBnisfiles\fR(4), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.LP
Error messages are sent to the \fBsyslogd\fR(1M) daemon.
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating system. Tools to aid the migration from NIS+ to LDAP are available in the current Solaris release. For more information, visit http://www.sun.com/directory/nisplus/transition.html.
