TritonDataCenter/smartos-live/man/man/man1m/pcmciad.1m
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH pcmciad 1M "20 Mar 1995" "SunOS 5.11" "System Administration Commands"
.SH NAME
pcmciad \- PCMCIA user daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/pcmciad\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBPCMCIA\fR user daemon provides user-level services for the \fBPCMCIA\fR nexus driver and \fBPCMCIA\fR card client drivers. There are no user-configurable options for this daemon.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcmcu
.TE

.SH SEE ALSO
.sp
.LP
\fBpcmcia\fR(7D), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fB\fBpcmciad: can't open /dev/pem: No such file or directory\fR\fR
.ad
.sp .6
.RS 4n
The user daemon could not communicate with the \fBPCMCIA\fR event management driver.
.RE

