TritonDataCenter/smartos-live/man/man/man1m/sysidconfig.1m
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH sysidconfig 1M "23 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
sysidconfig \- execute system configuration applications, or define set of system configuration applications
.SH SYNOPSIS
.LP
.nf
\fBsysidconfig\fR [\fB-lv\fR] [\fB-a\fR \fIapplication\fR] [\fB-b\fR \fIbasedir\fR] 
     [\fB-r\fR \fIapplication\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Invoked without any options, the \fBsysidconfig\fR program executes a list of applications. An application on this list is referred to as a "system configuration application." Every application on this list will be passed one command-line argument, \fB-c\fR. This flag will cause the system configuration application to perform its configuration function. Without options, \fBsysidconfig\fR should only be invoked by startup scripts, which occurs during the initial installation and during a reconfigure reboot.
.sp
.LP
All applications on the list will be executed, if possible. All activity taken by the \fBsysidconfig\fR program is logged in the \fBsysidconfig\fR log file, \fB/var/log/sysidconfig.log\fR. If one or more of the applications on the list are either not present at execution time, are not executable, or execute but return a failure code upon completion, then that information will be logged as well. Successful completion of the program can be assumed if no error message is present in the log file. Programs are executed sequentially, with only one configuration application active at a time.
.sp
.LP
Executed with the \fB-l\fR, \fB-a\fR, or \fB-r\fR options, the \fBsysidconfig\fR program allows the super-user to list the defined configuration applications, and to add items to or remove items from that list. Running \fBsysidconfig\fR with options is the only way to view or manipulate the list. Only the super-user can execute the \fBsysidconfig\fR program with options.
.sp
.LP
The \fB-b\fR and \fB-v\fR options change the behavior of \fBsysidconfig\fR, and can be used with or without the list manipulation options discussed above. The \fB-b\fR \fIbasedir\fR option is used to specify a reference \fBroot\fR directory other than the default, \fB/\fR. The \fB-v\fR option duplicates the log file output on \fBstdout\fR.
.sp
.LP
By default, no SPARC based applications exist on this list.
.sp
.LP
This application is an extension of the \fBsysidtool\fR(1M) suite of programs. It is executed during initial installation and during a reconfigure reboot, before the window system has been started. Graphical User Interface (GUI) applications will not execute successfully if they are added to the list of configuration applications via \fBsysidconfig\fR \fB-a\fR.
.sp
.LP
This program is referenced, but not fully described, in the \fBsysidtool\fR(1M) manual page.
.SH OPTIONS
.sp
.LP
The valid options are:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIapplication\fR\fR
.ad
.sp .6
.RS 4n
Add the named application to the list of defined applications. When next invoked without arguments, \fBsysidconfig\fR will run this newly added application after all previously defined applications. \fIapplication\fR must be a fully qualified path name that is not currently on the list of applications to execute.
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-b\fR \fIbasedir\fR\fR
.ad
.sp .6
.RS 4n
Specify an alternate base directory (\fB/\fR is defined as the default base directory if no other is specified). The specified directory is used as the \fBroot\fR directory when adding, listing, removing, or executing configuration applications. The log file where information is recorded is in \fB/var/log\fR, relative to the specified \fIbasedir\fR. In the log file, the \fIbasedir\fR is not noted. This means, for example, that if the super-user on a diskless client's server executes:
.sp
.in +2
.nf
\fBsysidconfig\fR \fB-b\fR \fB/export/root/\fIclient\fR\fR \fB-a\fR \fB/sbin/\fIsomeapp\fR\fR
.fi
.in -2
.sp

then the diskless client \fIclient\fR would have \fB/sbin/\fR\fIsomeapp\fR executed upon reconfigure reboot. The diskless client's log file would note that \fB/sbin/\fR\fIsomeapp\fR was added, not \fB/export/root/client/sbin/\fR\fIsomeapp.\fR
.LP
Note - 
.sp
.RS 2
The root file system of any non-global zones must not be referenced with the \fB-b\fR option. Doing so might damage the global zone's file system, might compromise the security of the global zone, and might damage the non-global zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
List defined configuration applications. Applications will be executed one at a time, in the order shown in the list.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIapplication\fR\fR
.ad
.sp .6
.RS 4n
Remove the named application from the list of defined applications. \fIapplication\fR must be a fully qualified path name and it must be on the existing list of applications to execute.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Verbose mode. This option echoes all information sent to the log file to \fBstdout\fR. Such information includes timestamp information about when the program was executed, the names of applications being executed, and results of those executions.
.RE

.SH RETURN VALUES
.sp
.LP
The \fBsysidconfig\fR program will return \fB0\fR if it completes successfully.
.sp
.LP
When executed with the \fB-r\fR or \fB-a\fR options, error conditions or warnings will be reported on \fBstderr\fR. If the requested action completes successfully, an exit code of \fB0\fR will be returned.
.SH ERRORS
.sp
.ne 2
.mk
.na
\fB\fBEPERM\fR\fR
.ad
.sp .6
.RS 4n
The program was executed by a user other than the super-user.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEINVAL\fR\fR
.ad
.sp .6
.RS 4n
Option \fB-l\fR, \fB-a\fR, or \fB-r\fR was passed and the action could not be completed successfully.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/log/sysidconfig.log\fR\fR
.ad
.sp .6
.RS 4n
\fBsysidconfig\fR log file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWadmap
.TE

.SH SEE ALSO
.sp
.LP
\fBsys-unconfig\fR(1M), \fBsysidtool\fR(1M), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.LP
When run without options, a log of the \fBsysidconfig\fR program's activity can be found in \fB/var/log/sysidconfig.log\fR. This file contains a timestamp log of each program executed, its resulting \fBstderr\fR output, and its exit code. If an application in the list was not found or is not executable, that will also be noted.
