TritonDataCenter/smartos-live/man/man/man1m/sysidtool.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH sysidtool 1M "28 Nov 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
sysidtool, sysidnet, sysidns, sysidsys, sysidroot, sysidpm, sysidnfs4, sysidkbd \- system configuration
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/sysidnet\fR 
.fi

.LP
.nf
\fB/usr/sbin/sysidns\fR 
.fi

.LP
.nf
\fB/usr/sbin/sysidsys\fR 
.fi

.LP
.nf
\fB/usr/sbin/sysidroot\fR 
.fi

.LP
.nf
\fB/usr/sbin/sysidpm\fR 
.fi

.LP
.nf
\fB/usr/sbin/sysidnfs4\fR 
.fi

.LP
.nf
\fB/usr/sbin/sysidkbd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBsysidtool\fR is a suite of programs that configure a new system, or one that has been unconfigured with \fBsys-unconfig\fR(1M). The \fBsysidtool\fR programs run automatically at system installation, or during the first boot after a machine has been successfully unconfigured.
.sp
.LP
These programs have no effect except at such times, and should never be run manually.
.sp
.LP
The \fBsysidtool\fR programs set up the appropriate information in the machine's configuration files, in the kernel, and on the machine's network interface. The following list shows the available commands and the information for which each of the commands lists.
.sp
.ne 2
.mk
.na
\fB\fBsysidnet\fR: network configuration\fR
.ad
.sp .6
.RS 4n
Machine's default locale. Machine's console type. Machine's host name. Machine's IP address.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsysidns\fR: name service configuration\fR
.ad
.sp .6
.RS 4n
Name service choice: NIS, NIS+, \fBDNS\fR, LDAP, or none. Machine's \fBIP\fR subnet mask (if no NIS/NIS+ server can automatically be located on the machine's sub-network. Domain name for chosen name service. Hostname and IP address of name server(s). \fBDNS\fR search list (\fBDNS\fR name service only)
.RE

.sp
.ne 2
.mk
.na
\fB\fBsysidsys\fR: miscellaneous system configuration\fR
.ad
.sp .6
.RS 4n
Machine's \fBIP\fR subnet mask (if an NIS/NIS+ server was automatically located on the machine's sub-network). Machine's time zone. Date and time.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsysidroot\fR: control superuser information\fR
.ad
.sp .6
.RS 4n
Machine's root password.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsysidpm\fR: power management configuration\fR
.ad
.sp .6
.RS 4n
Auto-shutdown confirmation if the system is Energystar-V2 compliant, that is, a new system model shipped after October 1, 1995.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsysidnfs4\fR: NFSv4 domain configuration\fR
.ad
.sp .6
.RS 4n
Domain name to be used by NFSv4 client(s) and server(s) to transmit user and group id's as strings of the general form "[\fIuser\fR|\fIgroup\fR]@\fIdomain\fR".
.RE

.sp
.ne 2
.mk
.na
\fB\fBsysidkbd\fR: keyboard layout configuration\fR
.ad
.sp .6
.RS 4n
The corresponding keytable is loaded into the kernel according to the configured keyboard layout.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsysidconfig\fR: host- or platform-specific configuration\fR
.ad
.sp .6
.RS 4n
This command controls specification and execution of custom configuration applications that can be specified for a particular host or a particular platform. See \fBsysidconfig\fR(1M).
.RE

.sp
.LP
The \fBsysidtool\fR programs attempt to obtain system configuration information from various name service databases, for example, NIS, or from the \fBsysidcfg\fR(4) file, and you are prompted to provide the information if it cannot be found. However, you can avoid one or more of the prompts by preconfiguring the appropriate configuration information in the name service databases or in the \fBsysidcfg\fR(4) file.
.sp
.LP
To preconfigure the information in the name service databases, you must use the name service commands or the Solstice AdminSuite tools. See \fI\fR for more details about how to preconfigure the system configuration information.
.sp
.LP
The machine's configuration information is set up in its \fB/etc\fR and \fB/var\fR files.
.sp
.LP
If a system has more than one network interface, you can use \fBsysidtool\fR to configure all interfaces on the system.
.sp
.LP
You cannot use the name service databases or the \fBsysidcfg\fR(4) file to suppress the Power Management configuration prompt. However, you can suppress it by creating either the \fB/autoshutdown\fR or \fB/noautoshutdown\fR file before installation reboot. Accordingly, the auto-shutdown feature is silently configured. The \fB/autoshutdown\fR or \fB/noautoshutdown\fR files are removed by \fBsysidpm\fR before it exits.
.sp
.LP
\fBsysidnfs4\fR installs the \fB/etc/.NFS4inst_state.domain\fR file upon the successful configuration of the NFSv4 domain name. If this file is present during system reboot, the \fBsysidnfs4\fR program is run but no prompts are displayed. The suppression of prompts is intended for system upgrades, in which a system configuration typically stays unchanged. The stability level of this interface is obsolete 
.sp
.LP
\fBsysidkbd\fR prompts for the keyboards with \fBzero-bCountryCode\fR and then sets the keyboard layout string in the \fB/etc/default/kbd\fR file. If the \fBsysidkbd\fR gets the valid keyboard layout string, the string will be set into the entry "LAYOUT=" in the file.
.SH FILES
.br
.in +2
\fB/etc/.UNCONFIGURED\fR
.in -2
.br
.in +2
\fB/etc/nodename\fR
.in -2
.br
.in +2
\fB/etc/hostname.??[0-9]\fR
.in -2
.br
.in +2
\fB/etc/default/init\fR
.in -2
.br
.in +2
\fB/etc/defaultdomain\fR
.in -2
.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
.rt  
password file. See \fBpasswd\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shadow\fR\fR
.ad
.RS 15n
.rt  
shadow password file. See \fBshadow\fR(4).
.RE

.br
.in +2
\fB/etc/inet/hosts\fR
.in -2
.br
.in +2
\fB/etc/inet/netmasks\fR
.in -2
.br
.in +2
\fB/var/nis/NIS_COLD_START\fR
.in -2
.br
.in +2
\fB/var/yp/aliases\fR
.in -2
.br
.in +2
\fB/var/yp/binding/*/ypservers\fR
.in -2
.br
.in +2
\fB/etc/.sysIDtool.state\fR
.in -2
.sp
.ne 2
.mk
.na
\fB\fB/etc/power.conf\fR\fR
.ad
.RS 24n
.rt  
Power Management configuration file. See \fBpower.conf\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/.PM_RECONFIGURE\fR\fR
.ad
.RS 24n
.rt  
If this file is present during system reboot, the \fBsysidpm\fR program is run. This file is removed by \fBsysidpm\fR.
.RE

.br
.in +2
\fB/etc/.NFS4inst_state.domain\fR
.in -2
.br
.in +2
\fB/etc/default/kdb\fR
.in -2
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWadmap, SUNWpmu
.TE

.SH SEE ALSO
.sp
.LP
\fBpowerd\fR(1M), \fBsys-unconfig\fR(1M), \fBsysidconfig\fR(1M), \fBpasswd\fR(4), \fBpower.conf\fR(4), \fBshadow \fR(4), \fBsysidcfg\fR(4), \fBattributes\fR(5)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating system. Tools to aid the migration from NIS+ to LDAP are available in the current Solaris release. For more information, visit http://www.sun.com/directory/nisplus/transition.html.
