TritonDataCenter/smartos-live/man/man/man1m/vdiskadm.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with
.\" the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH vdiskadm 1M "2 Apr 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
vdiskadm \- create and manage virtual disks
.SH SYNOPSIS
.LP
.nf
\fBvdiskadm\fR create \fB-s\fR \fIsize\fR [\fB-t\fR \fItype\fR[:\fIopt\fR],[\fIopt\fR]
     [\fB-c\fR \fIcomment\fR] \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR destroy [\fB-r\fR] \fIvdname\fR|\fIsnapshot\fR
.fi

.LP
.nf
\fBvdiskadm\fR snapshot \fIvdname\fR@\fIsnapname\fR
.fi

.LP
.nf
\fBvdiskadm\fR rollback [\fB-r\fR] \fIsnapshot\fR
.fi

.LP
.nf
\fBvdiskadm\fR clone [\fB-c\fR \fIcomment\fR] \fIvdname\fR|\fIsnapshot\fR \fIclone_vdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR move \fIvdname\fR \fIdir\fR
.fi

.LP
.nf
\fBvdiskadm\fR rename \fIvdname\fR|\fIsnapshot\fR \fIvdname\fR|\fIsnapshot\fR
.fi

.LP
.nf
\fBvdiskadm\fR list [\fB-fp\fR]\fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR verify \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR prop-get [\fB-l\fR] \fB-p\fR \fIproperty\fR \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR prop-set  \fB-p\fR \fIproperty\fR=\fIvalue\fR \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR prop-add  \fB-p\fR \fIproperty\fR=\fIvalue\fR \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR prop-del  \fB-p\fR \fIproperty\fR \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR import [\fB-fnpqm\fR] [\fB-x\fR \fItype\fR] \fB-d\fR file|zvol|dsk
     [\fB-t\fR \fItype\fR[:\fIopt\fR]] \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR export \fB-x\fR \fItype\fR[:\fIopt\fR] \fB-d\fR file|zvol|dsk \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR convert [\fB-t\fR \fItype\fR[:\fIopt\fR]] \fIvdname\fR
.fi

.LP
.nf
\fBvdiskadm\fR translate [\fB-i\fR \fItype\fR[:\fIopt\fR]] \fB-I\fR \fIinput_file\fR \fB-x\fR \fItype\fR[:\fIopt\fR]
     \fB-d\fR \fIoutput_file\fR
.fi

.LP
.nf
\fBvdiskadm\fR help [\fIcommand\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBvdiskadm\fR command manages virtual disks within \fBdom0\fR. In the SYNOPSIS above, \fIvdname\fR is the pathname of the virtual disk; it has a maximum length of \fBMAXPATHLEN\fR (1024 bytes).
.sp
.LP
\fBvdiskadm\fR is implemented as a set of subcommands, many with their own options and operands. These subcommands are described under "Subcommands," below.
.sp
.LP
The following subsections describe concepts related to virtual disks.
.SS "Snapshots"
.sp
.LP
A snapshot is a read-only copy of a virtual disk. Snapshots can be created extremely quickly and initially consume little space. As data  within the active virtual disk changes, the snapshot consumes more data than would otherwise be shared with the active virtual disk.
.SS "Clones"
.sp
.LP
A clone is a writable copy of a virtual disk. The default type of clone is a merged (that is, coalesced) copy of the original virtual disk. An example of a merged clone occurs when a virtual disk is comprised of several snapshots; a subsequent clone operation results in a new virtual disk containing no snapshots. A clone will be of the same type as the original virtual disk (that is, \fBvmdk:fixed\fR). When a merged clone is created there is no linkage back to the original virtual disk or to any of its snapshots. This lack of linkage allows the merged clone to be moved to another physical machine.
.SS "Numeric Values"
.sp
.LP
The values of numeric properties can be specified using human-readable suffixes, such as \fBk\fR, \fBKB\fR, \fBM\fR, \fBGb\fR, and so forth, up to \fBZ\fR for zettabyte).  The  following are all valid (and equal) specifications:
.sp
.in +2
.nf
1536M  1.5g  1.50GB
.fi
.in -2
.sp

.SS "Types of Virtual Disks"
.sp
.LP
The following types and options of virtual disks are supported:
.RS +4
.TP
.ie t \(bu
.el o
\fBvmdk:fixed\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBvmdk:sparse\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBvdi:fixed\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBvdi:sparse\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBvhd:fixed\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBvhd:sparse\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBraw:fixed\fR
.RE
.sp
.LP
where \fBvmdk\fR is the native VMware format, \fBvdi\fR is the native VirtualBox format, \fBvhd\fR is the native Microsoft format, and \fBraw\fR describes a file that looks like a raw disk. A \fBraw\fR disk is always in fixed format so that option can be explicitly set or implicitly understood.
.sp
.LP
If the type is not specified, the default value is \fBvmdk\fR. If the option is not specified, the default value is \fBfixed\fR for type \fBraw\fR and \fBsparse\fR for types \fBvmdk\fR, \fBvdi\fR, and \fBvhd\fR.
.SS "Native and User-defined Properties"
.sp
.LP
Properties are divided into two types, native and user defined. Native properties either export internal statistics or control \fBvdiskadm\fR behavior. In addition, native properties are either editable or read-only. User-defined properties are arbitrary strings that have no effect on \fBvdiskadm\fR behavior. You can use them to annotate virtual disks in a way that is meaningful in your environment. User-defined property names must contain a colon (\fB:\fR) character, to distinguish them from native properties.
.sp
.LP
Properties are associated only with the virtual disk and not with individual snapshots.
.sp
.LP
Every virtual disk has a set of native properties that export statistics about the virtual disk, as well as control various behaviors.
.sp
.LP
The following are the native properties for a virtual disk:
.sp
.ne 2
.mk
.na
\fB\fBcdrom\fR\fR
.ad
.sp .6
.RS 4n
Boolean property that is true if the virtual disk is a CDROM.
.RE

.sp
.ne 2
.mk
.na
\fB\fBremovable\fR\fR
.ad
.sp .6
.RS 4n
Boolean property that is true if the virtual disk is a removable media.
.RE

.sp
.ne 2
.mk
.na
\fB\fBreadonly\fR\fR
.ad
.sp .6
.RS 4n
Boolean property that is true if the virtual disk is read-only. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsectors\fR\fR
.ad
.sp .6
.RS 4n
Numeric property containing the number of disk sectors in the given virtual disk. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBname\fR\fR
.ad
.sp .6
.RS 4n
String property that is the name of the virtual disk. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmax-size\fR\fR
.ad
.sp .6
.RS 4n
Numeric property containing the maximum size of the virtual disk in bytes. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBeffective-size\fR\fR
.ad
.sp .6
.RS 4n
Numeric property containing the effective size of the virtual disk, in bytes. The effective size includes  the size of the data file and all snapshots. The effective size can exceed the maximum size. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcreation-time\fR\fR
.ad
.sp .6
.RS 4n
String property containing the date and time that the virtual disk was created. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcreation-time-epoch\fR\fR
.ad
.sp .6
.RS 4n
Numeric property describing the creation-time property in seconds since the epoch (seconds since 00:00:00 UTC, Jan. 1, 1970). This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodification-time\fR\fR
.ad
.sp .6
.RS 4n
String property containing the date and time of last modification to virtual disk. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodification-time-epoch\fR\fR
.ad
.sp .6
.RS 4n
Numeric property describing the modification-time property in seconds since the epoch (seconds since 00:00:00 UTC, Jan. 1, 1970). This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdescription\fR\fR
.ad
.sp .6
.RS 4n
String property that contains the comment given when the virtual disk was created or cloned. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtype\fR\fR
.ad
.sp .6
.RS 4n
String property that contains the type of virtual disk: \fBvmdk\fR, \fBvhd\fR, \fBvdi\fR, or \fBraw\fR. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsparse\fR\fR
.ad
.sp .6
.RS 4n
Boolean property that is true if the virtual disk is in \fBsparse\fR format. This property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBowner\fR\fR
.ad
.sp .6
.RS 4n
String property that contains the user name of the owner of the virtual disk. This property is editable.
.RE

.SH SUB-COMMANDS
.sp
.LP
The \fBvdiskadm\fR subcommands and their arguments are described in the following subsections.
.SS "\fBvdiskadm create\fR"
.sp
.in +2
.nf
vdiskadm create \fB-s\fR \fIsize\fR [\fB-t\fR \fItype\fR[:\fIopt\fR],[\fIopt\fR]]
     [\fB-c\fR \fIcomment\fR] \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Creates a new virtual disk of the specified size and at the location specified by \fIvdname\fR. If \fIvdname\fR includes a path to the virtual disk, the directories that follow from that path will be created during creation of the virtual disk. This subcommand has the options listed below.
.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR[:\fIopt\fR],[\fIopt\fR]]\fR
.ad
.sp .6
.RS 4n
Specifies the type of virtual disk to be created. The default type is \fBvmdk\fR. For \fBvmdk\fR and \fBvdi\fR types the default option is \fBsparse\fR. For type \fBraw\fR the default option is \fBfixed\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcomment\fR\fR
.ad
.sp .6
.RS 4n
Comment that can be attached to virtual disk.
.RE

.SS "\fBvdiskadm destroy\fR"
.sp
.in +2
.nf
vdiskadm destroy [\fB-r\fR] \fIvdname\fR|\fIsnapshot\fR
.fi
.in -2
.sp

.sp
.LP
Destroys the specified virtual disk or snapshot. By default, the destroy operation fails if the specified virtual disk contains snapshots. This subcommand has the option listed below.
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
Recursively destroys the virtual disk, including all snapshots associated with the virtual disk.
.RE

.SS "\fBvdiskadm snapshot\fR"
.sp
.in +2
.nf
vdiskadm snapshot \fIvdname\fR@\fIsnapname\fR
.fi
.in -2
.sp

.sp
.LP
Creates a snapshot of the virtual disk with the specified \fIsnapname\fR. This subcommand has no options.
.SS "\fBvdiskadm rollback\fR"
.sp
.in +2
.nf
vdiskadm rollback [\fB-r\fR] \fIsnapshot\fR
.fi
.in -2
.sp

.sp
.LP
Roll back the virtual disk to a previous snapshot. When a virtual disk is rolled back, all data that has changed since the snapshot is discarded, and the virtual disk reverts to the state at the time of the snapshot. By default, the command refuses to roll back to a snapshot other than the most recent one. In order to roll back further, all intermediate snapshots must be destroyed by specifying the \fB-r\fR option. This subcommand has the option listed below.
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
Recursively destroy any snapshots more recent than the one specified.
.RE

.SS "\fBvdiskadm clone\fR"
.sp
.in +2
.nf
vdiskadm [\fB-c\fR \fIcomment\fR] \fIvdname\fR|\fIsnapshot\fR \fIclone_vdname\fR
.fi
.in -2
.sp

.sp
.LP
Creates a clone of the specified snapshot or virtual disk. The clone is created with the type and option and the size of the virtual disk being cloned. If \fIclone_vdname\fR includes a path the directories that flow from that path will be created during creation of the cloned virtual disk. By default, a merged clone image is created. This subcommand has the option listed below.
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcomment\fR\fR
.ad
.sp .6
.RS 4n
Comment that can be attached to cloned virtual disk.
.RE

.SS "\fBvdiskadm move\fR"
.sp
.in +2
.nf
vdiskadm move \fIvdname\fR \fIdir\fR
.fi
.in -2
.sp

.sp
.LP
Moves a specified virtual disk into the specified directory. The virtual disk maintains the same name. The new directory must exist. This subcommand has no options.
.SS "\fBvdiskadm rename\fR"
.sp
.in +2
.nf
vdiskadm rename \fIvdname\fR|\fIsnapshot\fR \fIvdname\fR|\fIsnapshot\fR
.fi
.in -2
.sp

.sp
.LP
Renames a virtual disk or snapshot. This subcommand has no options.
.SS "\fBvdiskadm list\fR"
.sp
.in +2
.nf
vdiskadm list [\fB-fp\fR]\fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Lists a specified virtual disk and its snapshots. This subcommand has the options listed below.
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Gives a list of all files associated with the virtual disk. This list includes the store file and the extents.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
Lists the files in an easily parsable format, prefixing the files with a label of \fBfile:\fR, \fBsnapshot:\fR, or \fBstore\fR.
.RE

.SS "\fBvdiskadm verify\fR"
.sp
.in +2
.nf
vdiskadm verify \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Returns an error if the virtual disk cannot be recognized or opened by Solaris xVM. This subcommand has no options.
.SS "\fBvdiskadm prop-get\fR"
.sp
.in +2
.nf
vdiskadm prop-get [\fB-l\fR] \fB-p\fR \fIproperty\fR \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Returns the value of the property for the specified virtual disk. A property value of \fBall\fR displays all native and user-defined properties for the virtual disk. This subcommand has the options listed below.
.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
Gives additional property information, such as the writeable status of property.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIproperty\fR\fR
.ad
.sp .6
.RS 4n
Specifies the property being queried and displays the value of the property. For the property \fBall\fR, the name of the property, a colon, and a space are displayed before the value of the property.
.RE

.SS "\fBvdiskadm prop-set\fR"
.sp
.in +2
.nf
vdiskadm prop-set \fB-p\fR \fIproperty\fR=\fIvalue\fR \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Sets the value of the specified property for the specified virtual disk. \fIproperty\fR can be a native or a user-defined property, but must be writable. Can be used to change the value of a property added with the \fBprop-add\fR subcommand. This subcommand has the option listed below.
.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Specifies the property being set.
.RE

.SS "\fBvdiskadm prop-add\fR"
.sp
.in +2
.nf
vdiskadm \fB-p\fR \fIproperty\fR=\fIvalue\fR \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Adds the user-defined property with the specified value to the specified virtual disk. Returns an error if the property already exists. The user-defined property name must contain a colon character (\fB:\fR). This subcommand has the option listed below.
.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Specifies the property being added.
.RE

.SS "\fBvdiskadm prop-del\fR"
.sp
.in +2
.nf
vdiskadm prop-del \fB-p\fR \fIproperty\fR \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Deletes a user-defined property from the specified virtual disk. This subcommand has the option listed below.
.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIproperty\fR\fR
.ad
.sp .6
.RS 4n
Specifies the property being deleted.
.RE

.SS "\fBvdiskadm import\fR"
.sp
.in +2
.nf
vdiskadm import [-fnpqm] [-x \fItype\fR] -d file|zvol|dsk \e
[-t \fItype\fR[:\fIopt\fR]] \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Creates a new virtual disk using data from a file or block device. The file may be in \fBvdi\fR, \fBvhd\fR, \fBvmdk\fR, or \fBraw\fR format. A block device is always assumed to be in raw format. This subcommand has the following options.
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Returns a list of files that will be used in the import process.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Show output from import without actually running the import.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
Displays files in an easily parsable format.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.sp .6
.RS 4n
Run in quiet mode giving no output.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
Move the imported file to virtual disk without copying the data.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fItype\fR\fR
.ad
.sp .6
.RS 4n
Specifies the type of virtual disk data being imported. If \fBvdiskadm\fR is unable to detect the imported file type, \fB-x\fR must be specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fBfile\fR|\fBzvol\fR|\fBdsk\fR\fR
.ad
.sp .6
.RS 4n
File or block device containing data to be imported.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR[:\fIopt\fR]\fR
.ad
.sp .6
.RS 4n
Specifies the type of virtual disk to be created on import. The default type is \fBvmdk\fR. For \fBvmdk\fR, \fBvdi\fR, and \fBvhd\fR types the default \fIopt\fR is \fBsparse\fR. For type \fBraw\fR the default \fIopt\fR is \fBfixed\fR.
.RE

.SS "\fBvdiskadm export\fR"
.sp
.in +2
.nf
vdiskadm export -x \fItype\fR[:\fIopt\fR] -d file|zvol|dsk \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Exports data from a virtual disk to a file or block device. This subcommand has the following options.
.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fItype\fR[:\fIopt\fR]\fR
.ad
.sp .6
.RS 4n
Specifies the type of virtual disk data being exported.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fBfile\fR|\fBzvol\fR|\fBdsk\fR\fR
.ad
.sp .6
.RS 4n
File or block device receiving data being exported.
.RE

.SS "\fBvdiskadm convert\fR"
.sp
.in +2
.nf
vdiskadm convert [-t \fItype\fR[:\fIopt\fR]] \fIvdname\fR
.fi
.in -2
.sp

.sp
.LP
Converts a virtual disk into a different type virtual disk. This subcommand has the following option.
.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR[:\fIopt\fR]\fR
.ad
.sp .6
.RS 4n
Specifies the type of virtual disk to be created upon conversion. The default type is \fBvmdk\fR. For \fBvmdk\fR, \fBvdi\fR, and \fBvhd\fR types the default \fIopt\fR is \fBsparse\fR. For type \fBraw\fR the default \fIopt\fR is \fBfixed\fR.
.RE

.SS "\fBvdiskadm translate\fR"
.sp
.in +2
.nf
vdiskadm translate [-i \fItype\fR[:\fIopt\fR]] -I \fIinput_file\fR \e
-x \fItype\fR[:\fIopt\fR] -d \fIoutput_file\fR
.fi
.in -2
.sp

.sp
.LP
Translate data from one virtual disk data type to another without creating a virtual disk. This subcommand has the following options.
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fItype\fR[:\fIopt\fR]\fR
.ad
.sp .6
.RS 4n
Specifies the input type of virtual disk data being translated. If \fBvdiskadm\fR is unable to detect the input file type, \fB-i\fR must be specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fIinput_file\fR\fR
.ad
.sp .6
.RS 4n
File or block device containing data being translated.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fItype\fR[:\fIopt\fR]\fR
.ad
.sp .6
.RS 4n
Specifies the output type of virtual disk data being translated. For \fBvmdk\fR, \fBvdi\fR, and \fBvhd\fR types the default \fIopt\fR is \fBsparse\fR. For type \fBraw\fR the default \fIopt\fR is \fBfixed\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIoutput_file\fR\fR
.ad
.sp .6
.RS 4n
File or block device receiving data being translated. \fIoutput_file\fR must not exist. The file will be created during translation.
.RE

.SS "\fBvdiskadm help\fR"
.sp
.in +2
.nf
vdiskadm help [\fIcommand\fR]
.fi
.in -2
.sp

.sp
.LP
Displays a general or command-specific help message. This subcommand has only the command name optional argument.
.SH EXAMPLES
.LP
\fBExample 1 \fRCreating a \fBvmdk\fR Sparse File
.sp
.LP
The following command creates a virtual disk named \fBdisk1\fR of size 8 GB in the directory \fB/guests/disks\fR.

.sp
.in +2
.nf
# \fBvdiskadm create -s 8g -t vmdk:sparse /guests/disks/disk1\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRCreating a Snapshot
.sp
.LP
The following command creates a snapshot of the virtual disk located at \fB/guests/disks/disk1\fR. The snapshot is named \fBinstall\fR.

.sp
.in +2
.nf
# \fBvdiskadm snapshot /guests/disks/disk1@install\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRCreating and Destroying Snapshots
.sp
.LP
The following commands create two snapshots, named \fBinstall\fR and \fBbfu\fR, of the virtual disk located at \fB/guests/disks/disk1\fR. The third command destroys the newly created snapshot \fBinstall\fR.

.sp
.in +2
.nf
# \fBvdiskadm snapshot /guests/disks/disk1@install\fR
# \fBvdiskadm snapshot /guests/disks/disk1@bfu\fR
# \fBvdiskadm destroy /guests/disks/disk1@install\fR
.fi
.in -2
.sp

.LP
\fBExample 4 \fRRolling Back a Virtual Disk
.sp
.LP
The following command reverts the contents of the virtual disk to the snapshot named \fBinstall\fR, deleting all intermediate snapshots.

.sp
.in +2
.nf
# \fBvdiskadm rollback -r /guests/disks/disk1@install\fR
.fi
.in -2
.sp

.LP
\fBExample 5 \fRListing a Virtual Disk and Snapshots
.sp
.LP
The following command lists all of the images associated with the virtual disk \fB/guests/disks/disk1\fR.

.sp
.in +2
.nf
# \fBvdiskadm list /guests/disks/disk1\fR
disk1@install
disk1@bfu
disk1
.fi
.in -2
.sp

.LP
\fBExample 6 \fRCreating a Clone
.sp
.LP
The following command creates a new virtual disk that is a coalesced copy of the virtual disk \fB/guests/disks/disk1\fR. The clone is created in the same format (that is, \fBvmdk:sparse\fR) as the original virtual disk.

.sp
.in +2
.nf
# \fBvdiskadm clone /guests/disks/disk1 /guests/clone/clone_disk1\fR
.fi
.in -2
.sp

.LP
\fBExample 7 \fRAdding a User-defined Property
.sp
.LP
The following command adds a user-defined property to the virtual disk and assigns it the specified value. This property name was chosen to represent the source and requirements of this virtual disk data using the required colon to delineate the fields.

.sp
.in +2
.nf
# \fBvdiskadm prop-add -p com.sun:required-nic=2 /guests/disks/disk1\fR
.fi
.in -2
.sp

.LP
\fBExample 8 \fRImporting Existing \fBvmdk\fR Format File
.sp
.LP
The following command takes an existing \fBvmdk\fR format file and imports it to a virtual disk.

.sp
.in +2
.nf
# \fBvdiskadm import -d /downloads/appliance.vmdk /guests/import/disk1\fR
.fi
.in -2
.sp

.LP
\fBExample 9 \fRImporting \fBvmdk\fR File and Converting to \fBvhd\fR
.sp
.LP
The following command takes an existing \fBvmdk\fR format file and, upon import, converts it to a \fBvhd\fR-type virtual disk.

.sp
.in +2
.nf
# \fBvdiskadm import -d /downloads/appliance.vmdk -t vhd \e\fR
\fB/guests/import/disk1\fR
.fi
.in -2
.sp

.LP
\fBExample 10 \fRImporting Data from \fBzvol\fR
.sp
.LP
The following command imports virtual disk data from a \fBzvol\fR and, upon import, converts it to a \fBvmdk:fixed\fR type virtual disk.

.sp
.in +2
.nf
# \fBvdiskadm import -d /dev/zvol/dsk/pool1/disk1 -t vmdk:fixed \e\fR
\fB/guests/import/disk1\fR
.fi
.in -2
.sp

.LP
\fBExample 11 \fRExporting Data to Block Device
.sp
.LP
The following command takes an existing virtual disk and, upon export, converts it to a disk slice, of \fBraw\fR type.

.sp
.in +2
.nf
# \fBvdiskadm export -d /dev/dsk/c0t1d0s3 -x raw /guests/disks/disk1\fR
.fi
.in -2
.sp

.LP
\fBExample 12 \fRConverting Virtual Disk Type
.sp
.LP
The following command takes an existing virtual disk and converts it (in place) to a different format type.

.sp
.in +2
.nf
# \fBvdiskadm convert -t vdi:fixed /guests/disks/disk1\fR
.fi
.in -2
.sp

.LP
\fBExample 13 \fRTranslating Data from One Type to Another
.sp
.LP
The following command translates data from a virtual disk format file to raw data written to a \fBzvol\fR without creating a virtual disk.

.sp
.in +2
.nf
# \fBvdiskadm translate -I /downloads/appliance.vmdk -x raw \e\fR
\fB-d /dev/zvol/dsk/pool1/disk1\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWvdisk
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBvirsh\fR(1M), \fBvirt-install\fR(1M), \fBattributes\fR(5), \fBxVM\fR(5)
