TritonDataCenter/smartos-live/man/usr/share/man/man1m/sys-unconfig.1m
'\" te
.\"  Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with
.\" the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH sys-unconfig 1M "23 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
sys-unconfig \- undo a system's configuration
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/sys-unconfig\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsys-unconfig\fR command is used to restore a system's configuration to an "as-manufactured" state, ready to be reconfigured again. The system's configuration consists of hostname, Network Information Service (NIS) domain name, timezone, \fBIP\fR address, \fBIP\fR subnet mask, and root password. This operation is the inverse of those performed by the \fBsysidnet\fR(1M), \fBsysidns\fR(1M), and \fBsysidsys\fR(1M) programs run at boot. See \fBsysidtool\fR(1M).
.sp
.LP
\fBsys-unconfig\fR does the following:
.RS +4
.TP
.ie t \(bu
.el o
Saves current \fB/etc/inet/hosts\fR file information in \fB/etc/inet/hosts.saved\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If the current \fB/etc/vfstab\fR file contains \fBNFS\fR mount entries, saves the \fB/etc/vfstab\fR file to \fB/etc/vfstab.orig\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Restores the default \fB/etc/inet/hosts\fR file.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removes the default hostname in \fB/etc/hostname.\fR\fIinterface\fR files for all interfaces configured when this command is run. To determine which interfaces are configured, run the command '\fBifconfig\fR\fB-a\fR'. The \fB/etc/hostname.\fR\fIinterface\fR files corresponding to all of the interfaces listed in the resulting output, with the exception of the loopback interface (lo0), will be removed.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removes the default domainname in \fB/etc/defaultdomain\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Restores the timezone to PST8PDT in \fB/etc/TIMEZONE\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Disables the Network Information Service (NIS) and Network Information Service Plus (NIS+) if either \fBNIS\fR or \fBNIS+\fR was configured.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removes the file \fB/etc/inet/netmasks\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removes the file \fB/etc/defaultrouter\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removes the password set for root in \fB/etc/shadow\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removes the file \fB/etc/.rootkey\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Executes all system configuration applications. These applications are defined by prior executions of a \fBsysidconfig\fR \fB-a\fR \fIapplication\fR. (See \fBsysidconfig\fR(1M)). When \fBsys-unconfig\fR is run, all system configuration applications are passed one argument, \fB-u\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removes the file \fB/etc/resolv.conf\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removes the file \fB/etc/sysidcfg\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Disables \fBLDAP\fR by removing \fB/var/ldap/ldap_client_cache\fR, \fB/var/ldap/ldap_client_file\fR, \fB/var/ldap/ldap_client_cred\fR, and \fB/var/ldap/cachemgr.log\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Regenerates keys for \fBsshd\fR(1M).
.RE
.sp
.LP
When \fBsys-unconfig\fR is finished, it performs a system shutdown. \fBsys-unconfig\fR is a potentially dangerous utility and can only be run by the super user.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/default/init\fR\fR
.ad
.sp .6
.RS 4n
process control initialization
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/defaultdomain\fR\fR
.ad
.sp .6
.RS 4n
determines host's domain name
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/defaultrouter\fR\fR
.ad
.sp .6
.RS 4n
specifies an IPv4 host's default router
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/hostname.\fR\fIinterface\fR\fR
.ad
.sp .6
.RS 4n
identifies symbolic host name associated with network interface \fIinterface\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/hosts\fR\fR
.ad
.sp .6
.RS 4n
host name database
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/netmasks\fR\fR
.ad
.sp .6
.RS 4n
network mask database
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/nodename\fR\fR
.ad
.sp .6
.RS 4n
local source for system name
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/.rootkey\fR\fR
.ad
.sp .6
.RS 4n
super-user's secret key
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shadow\fR\fR
.ad
.sp .6
.RS 4n
shadow password file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/sysidcfg\fR\fR
.ad
.sp .6
.RS 4n
system identification configuration file for diskless booting
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/vfstab\fR\fR
.ad
.sp .6
.RS 4n
virtual file system table
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/nis/NIS_COLD_START\fR\fR
.ad
.sp .6
.RS 4n
list of NIS+ servers that serve a host's default domain
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/yp/binding/*/ypservers\fR\fR
.ad
.sp .6
.RS 4n
identifies NIS servers to which the client is allowed to bind
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWadmap
.TE

.SH SEE ALSO
.sp
.LP
\fBinit\fR(1M), \fBsshd\fR(1M), \fBsysidconfig\fR(1M), \fBsysidtool\fR(1M), \fBhosts\fR(4), \fBnetmasks\fR(4), \fBshadow\fR(4), \fBsysidcfg\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
\fBsys-unconfig\fR is not available on diskless clients.
