TritonDataCenter/smartos-live/man/usr/share/man/man1m/zonemon.1m
'\" te
.\"  Copyright 2011, Joyent, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH zonemon 1M "8 Mar 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
zonemon \- display zone related troubleshooting data
.SH SYNOPSIS
.LP
.nf
\fBzonemon\fR [\fB-k\fR] [\fB-w\fR | \fB-z zonename\fR | \fB-Z\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBzonemon\fR command can print zone's kernel state that is useful for troubleshooting zone's related issues, as well as details related to zone state transitions.  This command is a useful first step for monitoring and troubleshooting zones.
.sp

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-k\fR
.ad
.RS 11n
.rt  
Print zone kernel state and exit without monitoring for zone state transitions.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR
.ad
.RS 11n
.rt  
Watch for zone state transitions and report details as they occur.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBzonename\fR
.ad
.RS 11n
.rt  
Watch the specified zone for shut down and reboot state transitions.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR
.ad
.RS 11n
.rt  
Watch all zones for shut down and reboot state transitions.
.RE

.SH SEE ALSO
.sp
.LP
\fBmdb\fR(1)
