TritonDataCenter/smartos-live/man/usr/share/man/man8/mkzpool.8
.Dd February 26, 2020
.Dt MKZPOOL 8
.Os
.Sh NAME
.Nm mkzpool
.Nd Create a zpool from a JSON specification
.Sh SYNOPSIS
.Cm mkzpool
.Op Fl ef
.Ar pool
.Ar file.json
.Sh DESCRIPTION
.Nm
functions as a wrapper around
.Xr zpool 8 .
It creates a pool named
.Ar pool
from a JSON specification in the file named
.Ar file.json
instead of command\-line arguments.
The input JSON must satisfy the schema described in the
.Xr disklayout 8
output specification.
.Ss OPTIONS
.Bl -tag -width Fl
.It Fl e
Encrypt.
Create the zpool as an encrypted zpool.
A PIV token must be present on the system for the command to succeed.
.It Fl f
Force.
This flag has the same meaning as the same flag when passed to
.Cm zpool create .
.El
.Sh WARNINGS
Use of this command is subject to the same caveats and warnings as the
.Xr zpool 8
create command.
.Sh "SEE ALSO"
.Xr disklayout 8 ,
.Xr zpool 8
